var dbStrQ = [
"[hexa] 乾 \n\
01 乾卦 乾為天 乾上乾下 \n\
 \n\
乾：元，亨，利，貞。 \n\
 \n\
《彖》曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形。大明始終，六位時成，時 乘六龍以御天。乾道變化，各正性命，保合大和，乃利貞。首出庶物，萬國咸寧。 \n\
 \n\
《象》曰：天行健，君子以自強不息。潛龍勿用，陽在下也。見龍再田，德施普也。終日乾 乾，反復道也。或躍在淵，進無咎也。飛龍在天，大人造也。亢龍有悔，盈不可久也。用 九，天德不可為首也。 \n\
 \n\
初九：潛龍勿用。        《象》曰：潛龍勿用，陽在下也。 \n\
九二：見龍在田，利見大人。      《象》日：見龍在田，德施普也。 \n\
九三：君子終日乾乾，夕惕若厲，無咎。    《象》曰：終日乾乾，反復道也。 \n\
九四：或躍在淵，無咎。  《象》曰：或躍在淵，進無咎也。 \n\
九五：飛龍在天，利見大人。      《象》曰：飛龍在天，大人造也。 \n\
上九：亢龍有悔。        《象》日：亢龍有悔，盈不可久也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
乾卦：乾為天，上下皆是乾。 \n\
 \n\
乾卦：元始之極，通達無阻，有利於堅守正道。 \n\
 \n\
《彖》說：哇！乾元之氣偉大無比，是萬物的源頭，統領著天地間的一切。像雲行雨施般，賦予萬物以生長與變化。大明始終，六位各司其職，時機如六龍乘風掌控著天象。乾卦代表著變化無窮的道路，各種事物都應該遵循其本性，以保持世間的和諧，這樣才有利於堅守正道。它是萬物萌生之初，讓世界各國都能安寧。 \n\
 \n\
《象》說：天行健，君子應該自強不息。潛龍不要現身，因為陽氣在下位。見到龍出現在田間，表示德行普遍散布。一天到晚都是乾卦，表明事物反覆循環。有時跳躍至深淵，但進取不會有災害。飛龍在天上，顯示了偉大人物的造化。但亢龍卻會後悔，因為過度溢滿不可持久。用九在上位，顯示天道無法為人所掌控。 \n\
 \n\
初九：潛龍不要現身。《象》說：潛龍不要現身，因為陽氣在下位。 \n\
 \n\
九二：見到龍出現在田間，有利於見到偉大人物。《象》說：見到龍出現在田間，表示德行普遍散布。 \n\
 \n\
九三：君子一天到晚都在思考反覆循環的道理，晚上保持警惕就像受到嚴厲的警告一樣，不會有災禍。《象》說：一天到晚都在思考反覆循環的道理，這是因為事物的道理反覆不息。 \n\
 \n\
九四：有時跳躍至深淵，但不會有災禍。《象》說：有時跳躍至深淵，進取不會有災禍。 \n\
 \n\
九五：飛龍在天上，有利於見到偉大人物。《象》說：飛龍在天上，顯示了偉大人物的造化。 \n\
 \n\
上九：亢龍會後悔。《象》說：亢龍會後悔，因為過度溢滿不可持久。 \n\
 \n\
",
"[hexa] 履 \n\
 \n\
履卦 天澤履 乾上兌下 \n\
 \n\
履：履虎尾，不咥人，亨。 \n\
 \n\
《彖》曰：履，柔履剛也。說而應乎乾，是以履虎尾，不咥人，亨。剛中正，履帝位而不 疚，光明也。 \n\
 \n\
《象》曰：上天下澤，履。君子以辨上下，定民志。 \n\
 \n\
初九：素履往，無咎。    《象》曰：素履之往，獨行願也。 \n\
九二：履道坦坦，幽人貞吉。      《象》曰：幽人貞吉，中不自亂也。 \n\
六三：眇能視，跛能履。履虎尾，咥人，凶。武人為於大君。  《象》曰：眇能視，不足以 有明也。跛能履，不足以與行也。咥人之凶，位不當也。武人為於大君，志剛也。 \n\
九四：履虎尾，愬愬，終吉。      《象》曰：愬愬終吉，志行也。 \n\
九五：夬履，貞厲。      《象》曰：夬履貞厲，位正當也。 \n\
上九：視履考祥，其旋元吉。      《象》曰：元吉在上，大有慶也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
履卦：天在上，澤在下，象徵著履行的意象。 \n\
 \n\
履卦：踐踏虎尾，虎不咬人，吉祥。 \n\
 \n\
《彖》說：履卦，柔者履行剛者，表現了柔順而順應乾卦的特性。因此，踐踏虎尾，虎不咬人，吉祥。剛強中正，履行至帝位而無懼懮，顯示了光明的道路。 \n\
 \n\
《象》說：上卦為天，下卦為澤，是履行的象徵。君子應當分清上下之辨，確定人民的志向。 \n\
 \n\
初九：素心履行，沒有災禍。《象》說：素心履行，獨自前進是因為有願望。 \n\
 \n\
九二：履行的道路平坦，對於隱居的人是吉祥。《象》說：隱居的人堅守正道是吉祥的，因為不會自亂。 \n\
 \n\
六三：視力微弱，行動蹣跚。踐踏虎尾，虎咬人，凶險。武人出現在大君面前。《象》說：視力微弱，不足以有明亮的視野。行動蹣跚，不足以行走。虎咬人是凶險的，因為位置不當。武人出現在大君面前，表示志向堅強。 \n\
 \n\
九四：踐踏虎尾，謹慎小心，最終吉祥。《象》說：謹慎小心最終吉祥，是因為有明確的志向。 \n\
 \n\
九五：斷然履行，貞卜會有危險。《象》說：斷然履行貞卜會有危險，是因為位置正當。 \n\
 \n\
上九：審視履行，思考吉祥，最終吉利。《象》說：最終吉利在上位，表示大有慶祝的好兆頭。 \n\
 \n\
 \n\
",
"[hexa] 同人 \n\
 \n\
同人卦 天火同人 乾上離下 \n\
 \n\
同人：同人於野，亨。利涉大川，利君子貞。 \n\
 \n\
《彖》曰：同人，柔得位得中，而應乎乾，曰同人。同人曰，同人於野，亨。利涉大川，乾 行也。文明以健，中正而應，君子正也。唯君子為能通天下之志。 \n\
 \n\
《象》曰：天與火，同人。君子以類族辨物。 \n\
 \n\
初九：同人於門，無咎。  《象》曰：出門同人，又 誰咎也。 \n\
六二：同人於宗，吝。    《象》曰：同人於宗，吝道也。 \n\
九三：伏戎於莽，升其高陵，三歲不興。    《象》曰：伏戎於莽，敵剛也。三歲不興，安行 也。 \n\
九四：乘其墉，弗克攻，吉。      《象》曰：乘其墉，義弗克也，其吉，則困而反則也。 \n\
九五：同人，先號咷而後笑。大師克相遇。  《象》曰：同人之先，以中直也。大師相遇，言相克也。 \n\
上九：同人於郊，無悔。  《象》曰：同人於郊，志未得也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
 \n\
同人卦：天在上，火在下，象徵著天與火同聚一堂。 \n\
 \n\
同人卦：在野外有相同的人聚會，吉祥。有利於涉越大河，有利於君子堅守正道。 \n\
 \n\
《彖》說：同人卦，柔者得到居中的位置，並且應和乾卦的力量，因此稱為同人。同人在野外聚會，吉祥。有利於涉越大河，表示乾卦的運動。文明與健全相輔相成，中正而應和，君子必須保持正道。唯有君子能夠通達天下眾人的志向。 \n\
 \n\
《象》說：天與火同聚，這就是同人的意象。君子應當用類型族類來區分事物。 \n\
 \n\
初九：在門外與同類相聚，沒有災禍。《象》說：走出門外與同類相聚，又誰會有災禍呢？ \n\
 \n\
六二：在宗廟中與同類相聚，會有困難。《象》說：在宗廟中與同類相聚，是因為道路有阻礙。 \n\
 \n\
九三：隱藏在草莽之中，攀登高陵，三年無法興起。《象》說：隱藏在草莽之中，是與強大的敵人對抗。三年無法興起，是為了保持安穩。 \n\
 \n\
九四：乘坐城墉，無法攻破，吉祥。《象》說：乘坐城墉，正義無法攻破，吉祥的原因是堅持正義，困境之下能夠反制。 \n\
 \n\
九五：同類相聚，先是號咷，後來笑出聲。大師互相克制。《象》說：同類相聚，先是號咷，後來笑出聲，表示先有一番爭執，然後和解。大師相遇，說明言語上有相互制約。 \n\
 \n\
上九：在郊外與同類相聚，不會後悔。《象》說：在郊外與同類相聚，表示志向未能實現，但不會後悔。 \n\
 \n\
",
"[hexa] 無妄 \n\
 \n\
無妄卦 天雷無妄 乾上震下 \n\
 \n\
無妄：元亨利貞。其匪正有眚，不利有攸往。 \n\
 \n\
《彖》曰：無妄，剛自外來而為主於內。動而健，剛中而應，大亨以正，天之命也。其匪正有眚，不利有攸往。無妄之往，何之矣？天命不佑，行矣哉？ \n\
 \n\
《象》曰：天下雷行，物與無妄。先王以茂對時，育萬物。 \n\
 \n\
初九：無妄，往吉。      《象》曰：無妄之往，得志也。 \n\
六二：不耕獲，不菑畲，則利有攸往。      《象》曰：不耕獲，未富也。 \n\
六三：無妄之災。或系之牛，行人之得，邑人之災。  《象》曰：行人得牛，邑人災也。 \n\
九四：可貞，無咎。      《象》曰：象曰：可貞無咎，固有之也。 \n\
九五：無妄之疾，勿藥有喜。      《象》曰：無妄之藥，不可試也。 \n\
上九：無妄，行有眚，無攸利。    《象》曰：無妄之行，窮之災也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
無妄卦：天在上，雷在下，象徵著天雷無妄的狀態。 \n\
 \n\
無妄卦：元始亨通，有利於堅守正道。但如果不正確，就會有災禍，不宜有所行動。 \n\
 \n\
《彖》說：無妄卦，是剛強的陽剛從外部侵入，主宰內部。行動是健壯的，剛強中正而應和，大吉大利是符合天命的。但如果不正確，就會有災禍，不利於有所行動。無妄的行動，何處去呢？如果天命不佑，那麼就會有困難了。 \n\
 \n\
《象》說：天下雷在行動，物事皆與無妄相應。先王以茂盛應時，培育萬物。 \n\
 \n\
初九：無妄而行，吉祥。《象》說：無妄的行動，能夠達成志向。 \n\
 \n\
六二：不耕種而能收穫，不需要灌溉田地，則有利於有所行動。《象》說：不耕種而不能富裕。 \n\
 \n\
六三：無妄的災害，可能是被牛所困擾，行人得到的牛會給城邑帶來災禍。《象》說：行人得到牛，對城邑來說是災禍。 \n\
 \n\
九四：可以堅守正道，沒有災禍。《象》說：可以堅守正道，沒有災禍，是因為固守自己的立場。 \n\
 \n\
九五：無妄的疾病，不用藥物反而有喜悅。《象》說：無妄的藥物，不能嘗試使用。 \n\
 \n\
上九：無妄而行，會有困難，沒有利益可得。《象》說：無妄的行動，會帶來困難，是窮困的災禍。 \n\
 \n\
",
"[hexa] 垢 \n\
 \n\
姤卦 天風姤 乾上巽下 \n\
 \n\
姤：女壯，勿用取女。 \n\
 \n\
《彖》曰：姤，遇也，柔遇剛也。勿用取女，不可與長也。天地相遇，品物咸章也。剛遇中正，天下大行也。姤之時義大矣哉！ \n\
 \n\
《象》曰：天下有風，姤；後以施命誥四方。 \n\
 \n\
初六：繫於金柅，貞吉。有攸往，見凶， 羸豕踟躅。 《象》曰：繫於金柅，柔道牽也。 \n\
九二：包有魚，無咎，不利賓。    《象》曰：包有魚，義不及賓也。 \n\
九三：臀無膚，其行次且，厲，無大咎。    《象》曰：其行次且，行未牽也。 \n\
九四：包無魚，起凶。    《象》曰：無魚之凶，遠民也。 \n\
九五：以杞包瓜，含章，有隕自天。        《象》曰：九五含章，中正也。有隕自天，志不捨命 也。 \n\
上九：姤其角，吝，無咎。        《象》曰：姤其角，上窮吝也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
姤卦：天在上，風在下，象徵著天風相遇的情況。 \n\
 \n\
姤卦：女性堅強，但不宜主動去追求男性。 \n\
 \n\
《彖》說：姤卦，表示相遇，柔弱的遇上剛強的。不應主動去追求男性，因為這樣的關係不可長久。天地相遇，萬物都會昭示吉祥。剛強者相遇而中正，是大勢所趨，天下大行。姤卦出現的時候，義理大矣啊！ \n\
 \n\
《象》說：天下有風，姤卦；後來要施行命令，宣告四方。 \n\
 \n\
初六：被繫於金柅，堅守正道吉祥。有所前進，會遇到凶險，瘸豬踟躅。《象》說：被繫於金柅，表示柔弱的道路是被拖著走的。 \n\
 \n\
九二：包含魚，無災無禍，但不利於待客。《象》說：包含魚，是因為義理不及於待客。 \n\
 \n\
九三：臀部沒有皮膚，行動遲緩，有危險，但不會有大的災禍。《象》說：行動遲緩，是因為行動未受拖累。 \n\
 \n\
九四：包裹中沒有魚，會發生凶險。《象》說：沒有魚的凶險，是因為離群遠離人群。 \n\
 \n\
九五：用杞木包裹葫蘆，含有象徵，有災禍自天而來。《象》說：九五含有象徵，表示中正；有災禍自天而來，是因為志節不捨命。 \n\
 \n\
上九：角落被擠壓，吝咎難免，但不會有大的災禍。《象》說：角被擠壓，上位窮困吝咎。 \n\
 \n\
 \n\
 \n\
 \n\
",
"[hexa] 訟 \n\
 \n\
訟卦 天水訟 乾上坎下 \n\
 \n\
訟：有孚，窒惕，中吉。終凶。利見大人，不利涉大川。 \n\
 \n\
《彖》曰：訟，上剛下險，險而健，訟。訟有孚，窒惕，中吉，剛來而得中也。終凶，訟不可成也。利見大人，尚中正也。不利涉大川，入於淵也。 \n\
 \n\
《象》曰：天與水違行，訟。君子以作事謀始。 \n\
 \n\
初六：不永所事，小有言，終吉。  《象》曰：不永所事，訟不可長也。雖有小言，其辯明也。 \n\
九二：不克訟，歸而逋，其邑人三百戶無眚。        《象》曰：不克訟，歸逋竄也。自下訟上， 患至掇也。 \n\
六三：食舊德，貞厲，終吉。或從王事，無成。      《象》曰：食舊德，從上吉也。 \n\
九四：不克訟，復自命，渝安貞，吉。      《象》曰：復即命，渝安貞；不失也。 \n\
九五：訟，元吉。        《象》曰：訟，元吉，以中正也。 \n\
上九：或錫之鞶帶，終朝三褫之。  《象》曰：以訟受福，亦不足敬也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
訟卦：天在上，水在下，形成乾上坎下的組合。 \n\
 \n\
訟卦：有人提起訴訟，有誠信，心中著急，中間吉祥。最終會有凶險。有利於見到尊貴的人，但不利於涉越大河。 \n\
 \n\
《彖》說：訟卦，上面是剛強的陽爻，下面是險隘的坎卦，險而強健，這就是訟卦。訟卦有人提起訴訟，有誠信，心中著急，中間吉祥，是因為剛強的力量來到中位。最終會有凶險，表示訴訟不應該進行。有利於見到尊貴的人，是因為尊貴的人中正。不利於涉越大河，是因為進入深淵之中。 \n\
 \n\
《象》說：天與水違反而行，這就是訟卦。君子應當在開始做事時謀求善始。 \n\
 \n\
初六：不要長期受牽制，會有一點爭議，最終吉祥。《象》說：不要長期受牽制，因為訟事不宜延續。雖然會有一些爭議，但辯明就能結束。 \n\
 \n\
九二：不能克制訴訟，回去逃避，回到自己的家鄉，沒有損害。《象》說：不能克制訴訟，只好回去逃避，這是因為下位的人訴訟上位的人，患難也只能這樣了。 \n\
 \n\
六三：食用舊有的美德，堅守正道會有危險，最終吉祥。或者投身於國王的事務，但不能成功。《象》說：食用舊有的美德，跟隨上位者吉祥。 \n\
 \n\
九四：不能克制訴訟，主動退讓，堅守正道，吉祥。《象》說：主動退讓，繼續堅守正道，吉祥。表示不會失敗。 \n\
 \n\
九五：訴訟最終吉祥。《象》說：訴訟最終吉祥，是因為中正。 \n\
 \n\
上九：或者給予他束帶，整天三次都要除去。《象》說：雖然通過訴訟獲得了福分，但也不值得尊敬。 \n\
 \n\
",
"[hexa] 遯 \n\
 \n\
遯卦 天山遯 乾上艮下 \n\
 \n\
遯：亨。小利貞。 \n\
 \n\
《彖》曰：遯亨，遯而亨也。剛當位而應，與時行也。小利貞，浸而長也。遯之時義大矣 哉。 \n\
 \n\
《象》曰：天下有山，遯。君子以遠小人，不惡而嚴。 \n\
 \n\
初六：遯尾，厲。勿用有攸往。    《象》曰：遯尾之厲，不往何災也。 \n\
六二：執之用黃牛之革，莫之勝說。        《象》曰：執用黃牛，固志也。 \n\
九三：系遯，有疾厲，畜臣妾，吉。        《象》曰：系遯之厲，有疾憊也。畜臣妾吉，不可大事也。 \n\
九四：好遯。君子吉，小人否。    《象》曰：君子好遯，小人否也。 \n\
九五：嘉遯，貞吉。      《象》曰：嘉遯貞吉，以正志也。 \n\
上九：肥遯，無不利。    《象》曰：肥遯，無不利，無所疑也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
遯卦：天在上，山在下，形成乾上艮下的組合。 \n\
 \n\
遯卦：通達，小有利於堅守正道。 \n\
 \n\
《彖》說：遯卦通達，遯離而通達。剛健處在正位並應時，隨著時勢而運行。小有利於堅守正道，逐漸延伸且長遠。遯卦的時機和義理都是很大的。 \n\
 \n\
《象》說：天下有山，遯卦。君子應當遠離小人，不是憎恨他們，而是保持嚴肅的態度。 \n\
 \n\
初六：尾隨遯走，會有危險。不要有所行動。《象》說：尾隨遯走會有危險，不行動就不會有災禍。 \n\
 \n\
六二：抓住它使用黃牛的皮革，沒有人能戰勝你。《象》說：抓住它使用黃牛，是堅定的志向。 \n\
 \n\
九三：被拘束而遯走，會有疾病和危險，但養育婢女卻吉祥。《象》說：被拘束而遯走會有疾病和危險，所以要謹慎。養育婢女吉祥，是因為不宜有大的計劃。 \n\
 \n\
九四：喜愛遯走。君子吉祥，小人則否。《象》說：君子喜愛遯走，小人則否。君子樂於堅守正道。 \n\
 \n\
九五：遯走得到喜悅，堅守正道吉祥。《象》說：遯走得到喜悅，是因為保持中正的志向。 \n\
 \n\
上九：豐滿而遯走，無不利。《象》說：豐滿而遯走，無不利，沒有猜疑。 \n\
 \n\
 \n\
",
"[hexa] 否 \n\
 \n\
否卦 天地否 乾上坤下 \n\
 \n\
否：否之匪人，不利君子貞，大往小來。 \n\
 \n\
《彖》曰：否之匪人，不利君子貞，大往小來。則是天地不交而萬物不通也，上下不交，而天下無邦也。內陰而外陽，內柔而外剛，內小人而外君子。小人道長，君子道消也。 \n\
 \n\
《象》曰：天地不交，否。君子以儉德辟難，不可榮以祿。 \n\
 \n\
初六：拔茅茹，以其匯，貞吉，亨。        《象》曰：拔茅貞吉，志在君也。 \n\
六二：包承，小人吉，大人否，亨。        《象》曰：大人否，亨，不亂群也。 \n\
六三：包羞。    《象》曰：包羞，位不當也。 \n\
九四：有命無咎，疇離祉。        《象》曰：有命無咎，志行也。 \n\
九五：休否，大人吉。其亡其亡，繫於苞桑。        《象》曰：大人之吉，位正當也。 \n\
上九：傾否，先否後喜。  《象》曰：否終則傾，何可長也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
否卦：天在上，地在下，形成乾上坤下的組合。 \n\
 \n\
否卦：拒絕不誠實之人，對君子的堅守不利，大的離去而小的來臨。 \n\
 \n\
《彖》說：拒絕不誠實之人，對君子的堅守不利，大的離去而小的來臨。這象徵著天地之間不交流，萬物無法通達；上下不交流，天下無法形成各自的國邦。內部陰氣而外部陽氣，內部柔弱而外部剛強，內部是小人而外部是君子。小人的道路得以長久，君子的道路則逐漸衰退。 \n\
 \n\
《象》說：天地之間不交流，這就是否卦。君子應當以節儉和德行來避開困難，不可因為獲得豐厚的祿而沾沾自喜。 \n\
 \n\
初六：拔除茅草，因其而匯聚，貞吉，通達。《象》說：拔除茅草，貞吉，志在於君子。 \n\
 \n\
六二：包容承擔，小人吉祥，大人則不利，通達。《象》說：大人否，通達，不混亂群體。 \n\
 \n\
六三：包容羞恥。《象》說：包容羞恥，是因為位置不當。 \n\
 \n\
九四：有使命而無災禍，善於分離，幸福。《象》說：有使命而無災禍，是因為志向得以實現。 \n\
 \n\
九五：休息不拒絕，對大人而言是吉祥。儘管有所失去，卻結果於茂盛。《象》說：大人之吉祥，是因為位置正當。 \n\
 \n\
上九：拒絕不誠實之人，先經歷拒絕，後經歷喜悅。《象》說：拒絕之結局是傾覆，何以能長久。 \n\
 \n\
 \n\
",
"[hexa] 夬 \n\
 \n\
 \n\
夬卦 澤天夬 兌上乾下 \n\
 \n\
夬：揚於王庭。孚號有厲。告自邑，不利即戎，利有攸往。 \n\
 \n\
《彖》曰：夬，決也，剛決柔也。健而說，決而和。揚於王庭，柔乘五剛也。孚號有厲， 其危乃光也。告自邑，不利即戎，所尚乃窮也。利有攸往，剛長乃終也。 \n\
 \n\
《象》曰：澤上於天，夬。君子以施祿及下，居德則忌。 \n\
 \n\
初九：壯於前趾，往不勝為吝。    《象》曰：不勝而往，咎也。 \n\
九二：惕號，莫夜有戎，勿恤。    《象》曰：有戎勿恤，得中道也。 \n\
九三：壯於頄，有凶。君子夬夬獨行，遇雨若濡，有慍無咎。  《象》曰：君子夬夬，終無咎也。 \n\
九四：臀無膚，其行次且。牽羊悔亡，聞言不信。    《象》曰：其行次且，位不當也。聞言不信，聰不明也。 \n\
九五：莧陸夬夬，中行無咎。      《象》曰：中行無咎，中未光也。 \n\
上六：無號，終有凶。    《象》曰：無號之凶，終不可長也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
夬卦：澤在上，天在下，形成兌上乾下的組合。 \n\
 \n\
夬卦：揚揚於王庭，表示果斷而有力。有誠信的呼號，會帶來危險。告別自己的城邑，不利於立即舉兵作戰，但有利於有所前進。 \n\
 \n\
《彖》說：夬卦，象徵著果斷，剛強決斷柔弱。強健而愉悅，果斷而和諧。揚揚於王庭，表示柔弱得以應對剛強。有誠信的呼號會帶來危險，但這種危險正是光明之前的考驗。告別自己的城邑，不利於立即舉兵作戰，表示所尚之事已經極限。有利於有所前進，因為剛強的力量能夠持久。 \n\
 \n\
《象》說：澤在上，天在下，這就是夬卦。君子應當施行祿濟眾，保持德行以免忌諱。 \n\
 \n\
初九：居前進的趾頭，前進而不能成功，會有困難。《象》說：前進而不能成功，是有過錯的表現。 \n\
 \n\
九二：謹慎呼號，夜間有戎兵，不要擔心。《象》說：有戎兵而不擔心，是因為保持中正之道。 \n\
 \n\
九三：居於頄上，會有凶險。君子果斷而獨自行動，遇到雨水就像濕淋一樣，會有懊惱但不會有咎。《象》說：君子果斷而獨自行動，最終不會有咎。 \n\
 \n\
九四：臀部沒有皮膚，行動緩慢。拉著羊去也會後悔，聽到勸告卻不相信。《象》說：行動緩慢，是因為位置不當。聽到勸告卻不相信，是因為聽覺不明晰。 \n\
 \n\
九五：如同稻子的榮華，中行而不會有咎。《象》說：中行而不會有咎，是因為中正之道尚未發光。 \n\
 \n\
上六：無聲無號，最終會有凶險。《象》說：無聲無號之凶險，最終無法持久。 \n\
 \n\
",
"[hexa] 兌 \n\
 \n\
兌卦 兌為澤 兌上兌下 \n\
 \n\
兌：亨，利貞。 \n\
 \n\
《彖》曰：兌，說也。剛中而柔外，說以利貞，是以順乎天而應乎人。說以先民，民忘其 勞。說以犯難，民忘其死。說之大，民勸矣哉。 \n\
 \n\
《象》曰：麗澤，兌。君子以朋友講習。 \n\
 \n\
初九：和兌，吉。        《象》曰：和兌之吉，行未疑也。 \n\
九二：孚兌，吉，悔亡。  《象》曰：孚兌之吉，信志也。 \n\
六三：來兌，凶。        《象》曰：來兌之凶，位不當也。 \n\
九四：商未寧，介疾有喜。        《象》曰：九四之喜，有慶也。 \n\
九五：孚於剝，有厲。    《象》曰：孚於剝，位正當也。 \n\
上六：引兌。    《象》曰：上六引兌，未光也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
兌卦：兌象徵著澤水亨通，兌上兌下形成澤在上的狀態。 \n\
 \n\
兌卦：通達，有利於堅守正道。 \n\
 \n\
《彖》說：兌，即為說。形象是剛強的內部與柔和的外部，以和諧為主，有利於堅守正道。因此，順應於天，並且能夠應對人事。通過和諧能先民之志，使人民忘卻辛勞；通過和諧能犯難而使人民忘卻死亡。和諧之大，使人民感到鼓舞。 \n\
 \n\
《象》說：澤水麗美，這就是兌卦。君子應當像朋友一樣彼此講習。 \n\
 \n\
初九：和諧而通達，吉祥。《象》說：和諧而通達之吉祥，是因為行動未受疑慮。 \n\
 \n\
九二：真誠而通達，吉祥，懊悔消失。《象》說：真誠而通達之吉祥，表示信任志向。 \n\
 \n\
六三：來臨的和諧，帶來凶險。《象》說：來臨的和諧帶來凶險，是因為位置不當。 \n\
 \n\
九四：商人尚未安定，但介紹帶來歡喜。《象》說：九四的歡喜，是因為有所慶賀。 \n\
 \n\
九五：真誠面對剝落，會有危險。《象》說：真誠面對剝落，表示位置正當。 \n\
 \n\
上六：引導和諧。《象》說：上六引導和諧，但光明未來尚未到來。 \n\
 \n\
 \n\
 \n\
",
"[hexa] 革 \n\
 \n\
革卦 澤火革 兌上離下 \n\
 \n\
革：己日乃孚。元亨利貞。悔亡。 \n\
 \n\
《彖》曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚，革而信之。文明以 說，大亨以正。革而當，其悔乃亡。天地革而四時成，湯武革命，順乎天而應乎人，革之時 義大矣哉。 \n\
 \n\
《象》曰：澤中有火，革。君子以治歷明時。 \n\
 \n\
初九：鞏用黃牛之革。    《象》曰：鞏用黃牛，不可以有為也。 \n\
六二：己日乃革之，徵吉，無咎。  《象》曰：己日革之，行有嘉也。 \n\
九三：徵凶貞厲。革言三就，有孚。        《象》曰：革言三就，又何之矣。 \n\
九四：悔亡，有孚，改命，吉。    《象》曰：改命之吉，信志也。 \n\
九五：大人虎變，未佔有孚。      《象》曰：大人虎變，其文炳也。 \n\
上六：君子豹變，小人革面，徵凶，居貞吉。        《象》曰：君子豹變，其文蔚也。小人革面， 順以從君也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
革卦：澤上火下，象徵水和火相息，兩女同居，志向不一致，所以稱為革。在己日乃得孚信，革變而有信仰。這是一個文明以謙遜為標誌，大亨以正義為基礎的時刻。革變而得當，悔恨就能消失。天地變革，四季交替，湯武進行革命，順應天命並符合人心，革變的時刻意義非常重大。 \n\
 \n\
《象》說：澤中有火，這就是革卦的卦象。君子應當治理歷史，明確把握時機。 \n\
 \n\
初九：使用黃牛的革帶，這是不可行動的象徵。《象》說：使用黃牛的革帶，是因為這不可為之。 \n\
 \n\
六二：在己日進行變革，徵兆吉利，沒有災難。《象》說：在己日進行變革，這樣的行動是有喜悅之兆。 \n\
 \n\
九三：變革帶來凶險，貞慎而厲害。言語上三次轉變，有誠實之心。《象》說：言語上三次轉變，還能怎樣呢？ \n\
 \n\
九四：悔恨消失，有誠實之心，改變命運，吉祥。《象》說：改變命運的吉祥，是因為有真誠的志向。 \n\
 \n\
九五：大人像虎一樣轉變，尚未佔有信仰。《象》說：大人像虎一樣轉變，其文明炳耀。 \n\
 \n\
上六：君子變得像豹一樣，小人變臉，預兆凶險，但守住正道則吉利。《象》說：君子變得像豹一樣，其文明蔚然。小人變臉，順應君主而行，這樣才能吉利。 \n\
 \n\
",
"[hexa] 隨 \n\
 \n\
隨卦 澤雷隨 兌上震下 \n\
 \n\
隨：元亨利貞，無咎。 \n\
 \n\
《彖》曰：隨，剛來而下柔，動而說，隨。大亨貞，無咎，而天下隨時。隨之時義大矣哉！ \n\
 \n\
《象》曰：澤中有雷，隨。君子以向晦入宴息。 \n\
 \n\
初九：官有渝，貞吉。出門交有功。        《象》曰： 官有渝，從正吉也。出門交有功，不失也。 \n\
六二：系小子，失丈夫。  《象》曰：系小子，弗兼與也。 \n\
六三：系丈夫，失小子。隨有求，得，利居貞。      《象》曰：系丈夫，志捨下也。 \n\
九四：隨有獲，貞凶。有孚，在道以明，何咎？      《象》曰：隨有獲，其義凶也。有孚在道， 明功也。 \n\
九五：孚於嘉，吉。      《象》曰：孚於嘉吉，位正中也。 \n\
上六：拘系之，乃從維之。王用亨於西山。  《象》曰：拘系之，上窮也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
隨卦：澤上雷下，象徵澤中有雷，稱之為隨。這卦表示剛健向上而下柔順，有活動和喜悅的意味。大亨而且貞正，沒有災難，符合天下隨著時勢變化的情況。隨卦的時刻意義非常重大。 \n\
 \n\
《象》說：澤中有雷，形成了隨卦的卦象。君子應當在晦澀時進入宴會，休息放鬆。 \n\
 \n\
初九：官職有變動，貞吉。出門交往有功績。《象》說：官職有變動，從正道走吉利之路。出門交往有功績，這樣就不會失敗。 \n\
 \n\
六二：約束小子，失去丈夫。《象》說：約束小子，不能同時照顧得失。 \n\
 \n\
六三：約束丈夫，失去小子。隨著事情的發展，有所求而得，有利於居住且正確。《象》說：約束丈夫，表示志向已經放棄下位。 \n\
 \n\
九四：隨著事物的發展而獲得，貞兆凶險。有誠實之心，在正道上表現明亮，這樣何咎？《象》說：隨著事物的發展而獲得，這樣的意義不好。有誠實之心在正道上表現，顯示出了功績。 \n\
 \n\
九五：誠實於嘉事，吉利。《象》說：對於美好的事物表現出真誠，吉利之事。 \n\
 \n\
上六：被拘束而不能行動，於是從而纏繞。君王應當在西山上通行。《象》說：被拘束而不能行動，顯示局面極端。 \n\
 \n\
",
"[hexa] 大過 \n\
 \n\
大過卦 澤風大過 兌上巽下 \n\
 \n\
大過：棟橈，利有攸往，亨。 \n\
 \n\
《彖》曰：大過，大者過也。棟橈，本末弱也。剛過而中，巽而說行，利有攸往，乃亨。大 過之時義大矣哉。 \n\
 \n\
《象》曰：澤滅木，大過。君子以獨立不懼，遯世無悶。 \n\
 \n\
初六：藉用白茅，無咎。  《象》曰：藉用白茅，柔在下也。 \n\
九二：枯楊生稊，老夫得其女妻，無不利。  《象》曰：老夫女妻，過以相與也。 \n\
九三：棟橈，凶。        《象》曰：棟橈之凶，不可以有輔也。 \n\
九四：棟隆，吉。它吝。  《象》曰：棟隆之吉，不橈乎下也。 \n\
九五：枯楊生華，老婦得士夫，無咎無譽。  《象》曰：枯楊生華，何可久也？老婦士夫，亦可醜也。 \n\
上六：過涉滅頂，凶，無咎。      《象》曰：過涉之凶，不可咎也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
大過卦：澤上風下，形成大過卦，象徵有大事發生，需要超越困難，並且順利。 \n\
 \n\
《彖》說：大過，指的是遇到了很大的困難。像橋樑的主構件過於堅硬而支持不住。剛強的力量超越了中道，以巽的柔順行事，有利於前進，於是亨通。大過之時的意義非常深遠。 \n\
 \n\
《象》說：澤水淹沒了木，形成大過卦。君子應當像橋樑一樣獨立不懼，躲避世俗的困擾。 \n\
 \n\
初六：用白茅做為蓋子，沒有災害。《象》說：使用白茅，表示柔順在下位。 \n\
 \n\
九二：乾枯的楊樹生出嫩芽，老夫得到年輕女子為妻，一切都吉利。《象》說：老夫得到年輕女子，是因為超越了年齡的障礙。 \n\
 \n\
九三：橋樑崩塌，有凶險。《象》說：橋樑崩塌，凶險，因為不能有所輔助。 \n\
 \n\
九四：橋墩穩固，吉利，但有小困難。《象》說：橋墩穩固，吉利，是因為不傾斜於下方。 \n\
 \n\
九五：乾枯的楊樹生出華麗的花朵，老婦人得到了年輕士人，沒有災害也沒有稱譽。《象》說：枯楊樹生華麗的花，表示這樣的情況難以持久。老婦人得到年輕士人，也容易引起非議。 \n\
 \n\
上六：過河涉水時，頂部被淹沒，有凶險，但最終沒有咎。《象》說：過河涉水時的凶險，但最終不受咎責。 \n\
 \n\
",
"[hexa] 困 \n\
 \n\
困卦 澤水困 兌上坎下 \n\
 \n\
困：亨，貞，大人吉，無咎。有言不信。 \n\
 \n\
《彖》曰：困，剛掩也。險以說，困而不失其所，亨，其唯君子乎。貞，大人吉，以剛中也。 有言不信，尚口乃窮也。 \n\
 \n\
《象》曰：澤無水，困。君子以致命遂志。 \n\
 \n\
初六：臀困於株木，入於幽谷，三歲不覿。  《象》曰：入於幽谷，幽不明也。 \n\
九二：困於酒食，朱紱方來，利用亨祀。徵凶，無咎。        《象》曰：困於酒食，中有慶也。 \n\
六三：困於石，據於蒺藜，入於其宮，不見其妻，凶。        《象》曰：據於蒺藜，乘剛也。入於其宮，不見其妻，不祥也。 \n\
九四：來徐徐，困於金車，吝，有終。      《象》曰：來徐徐，志在下也。雖不當位，有與也。 \n\
九五：劓刖，困於赤紱，乃徐有說，利用祭祀。      《象》曰：劓刖，志未得也。乃徐有說，以 中直也。利用祭祀，受福也。 \n\
上六：困於葛藟，於臲卼，曰動悔。有悔，徵吉。    《象》曰：困於葛藟，未當也。 動悔有悔，吉行也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
困卦：澤上水下，形成困卦，表示困難之中仍可亨通，貞正有利，對於大人吉祥，無咎。但有口中之言不可全信。 \n\
 \n\
《彖》說：困卦，象徵著堅強的隱藏。處在危險之中，但能保持自己的位置，亨通之時，這種處境唯有君子才能懂得。貞正，對於大人來說是吉祥的，因為堅中有柔。有口中之言不可信任，因為偏執的言論將走入死胡同。 \n\
 \n\
《象》說：澤上無水，形成困卦。君子應當使命達到，實現志向。 \n\
 \n\
初六：臀部困於株木之間，進入陰暗的谷地，三年無法脫困。《象》說：進入陰暗的谷地，因為幽暗而看不清楚。 \n\
 \n\
九二：陷於酒食之中，有婦女過來，利於進行祭祀。雖然有徵兆不祥，但沒有咎害。《象》說：陷於酒食之中，表示中間有喜慶之事。 \n\
 \n\
六三：陷於岩石之中，緊抓荊棘，進入宮殿，但看不見自己的妻子，凶險。《象》說：緊抓荊棘，是因為騎虎難下。進入宮殿看不見妻子，不祥之兆。 \n\
 \n\
九四：緩緩而來，困於金車，有困難，但最終會有結束。《象》說：緩緩而來，志向在下方。雖然位置不當，但有助於進展。 \n\
 \n\
九五：受割除之苦，困於赤紱，然後緩慢有所補救，利用祭祀。《象》說：受割除之苦，表示志向未達成。然後緩慢有所補救，是因為居中正。利用祭祀，會得到福祉。 \n\
 \n\
上六：困於葛藟之中，在陰險的山林之間，被動而悔恨。有悔恨，但最終有吉祥之兆。《象》說：困於葛藟之中，表示處境不當。被動而悔恨，有悔恨，但最終還是會吉祥。 \n\
 \n\
",
"[hexa] 咸 \n\
 \n\
咸卦 澤山咸 兌上艮下 \n\
 \n\
咸：亨，利貞。取女吉。 \n\
 \n\
《彖》曰：咸，感也。柔上而剛下，二氣感應以相與。止而說，男下女。是以亨利貞，取女 吉也。天地感而萬物化生，聖人感人心而天下和平。觀其所感，而天地萬物之情可見矣。 \n\
 \n\
《象》曰：山上有澤，咸。君子以虛受人。 \n\
 \n\
初六：咸其拇。  《象》曰：咸其拇，志在外也。 \n\
六二：咸其腓，凶，居吉。        《象》曰：雖凶居吉，順不害也。 \n\
九三：咸其股，執其隨，往吝。    《象》曰：咸其股，亦不處也。志在隨人，所執下也。 \n\
九四：貞吉悔亡，憧憧往來，朋從爾思。    《象》曰：貞吉悔亡，未感害也。憧憧往來，未光大也。 \n\
九五：咸其脢，無悔。    《象》曰：咸其脢，志末也。 \n\
上六：咸其輔，頰，舌。  《象》曰：咸其輔，頰，舌，滕口說也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
咸卦：澤上山下，形成咸卦，表示感應和諧，亨通，有利於貞正。娶妻吉祥。 \n\
 \n\
《彖》說：咸，表示感應。柔和的陰氣在上，堅強的陽氣在下，兩者感應相互作用。靜止而又柔和，男子在上，女子在下。因此，亨通和利於貞正，娶妻也是吉祥的。天地之間有感應，萬物生生不息。聖人感受眾生之心，使天下和平。觀察感應的情況，便可知曉天地和萬物之情。 \n\
 \n\
《象》說：山上有澤，形成咸卦。君子應當虛心接納人意。 \n\
 \n\
初六爻，腳趾相感。象傳曰：腳趾相感，志向在外。 \n\
六二爻，小腿相感，凶險，但居守正道吉祥。象傳曰：雖然凶險，但居守正道吉祥，順應自然不會有傷害。 \n\
九三爻，大腿相感，抓住隨從，前進會招致吝嗇。象傳曰：大腿相感，也是不安分的。志向在於追隨他人，所抓住的是卑賤的人。 \n\
九四爻，堅守正道吉祥，沒有悔恨。心神不定地往來，朋友們思念你。象傳曰：堅守正道吉祥，沒有悔恨，是因為還沒有受到傷害。心神不定地往來，是因為還沒有得到光大。 \n\
九五爻，胸腹相感，沒有悔恨。象傳曰：胸腹相感，志向已經達到終點。 \n\
上六爻，輔佐、臉頰、舌頭相感。象傳曰：輔佐、臉頰、舌頭相感，是口舌是非多。 \n\
 \n\
",
"[hexa] 萃 \n\
 \n\
萃卦 澤地萃 兌上坤下 \n\
 \n\
萃：亨。王假有廟。利見大人，亨，利貞。用大牲吉，利有攸往。 \n\
 \n\
《彖》曰：萃，聚也。順以說，剛中而應，故聚也。王假有廟，致孝享也。利見大人亨，聚以正也。用大牲吉，利有攸往，順天命也。觀其所聚，而天地萬物之情可見矣。 \n\
 \n\
《象》曰：澤上於地，萃。君子以除戎器，戒不虞。 \n\
 \n\
初六：有孚不終，乃亂乃萃。若號，一握為笑。勿恤，往無咎。        《象》曰：乃亂乃萃，其志亂也。 \n\
六二：引吉，無咎，孚乃利用禴。  《象》曰：引吉無咎，中未變也。 \n\
六三：萃如，嗟如，無攸利。往無咎，小吝。        《象》曰：往無咎，上巽也。 \n\
九四：大吉，無咎。      《象》曰：大吉無咎，位不當也。 \n\
九五：萃有位，無咎。匪孚，元永貞，悔亡。        《象》曰：萃有位，志未光也。 \n\
上六：賫咨涕洟，無咎。  《象》曰：賫咨涕洟，未安上也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
萃卦：亨通的卦象。王者在廟內行孝敬之禮，利於與大人見面，亨通，有利於貞正。以大牲祭祀可以獲得吉祥，利於有所前往。 \n\
 \n\
《彖》解說：萃，表示聚集。以順應而能取悅他人，剛健居中並能應機，所以有聚集的效果。王者在廟中行孝敬之禮，表達虔誠的敬意。利於與大人見面，因為聚集是為了正道。以大牲祭祀可以獲得吉祥，有利於順應天命。觀察聚集的情況，可以窺見天地萬物之情。 \n\
 \n\
《象》說：澤在地上，形成萃卦。君子應當除去戎器，提防不應該發生的事。 \n\
 \n\
初六：信任沒有持久，會變亂而形成聚集。像是在歡呼一握手為歡笑，不必擔憂，前進不會有咎。 \n\
 \n\
六二：引導吉祥，沒有咎害，取悅可以利用禴祭。這是因為引導吉祥，中位者無變動。 \n\
 \n\
六三：形成聚集，嘆息呼號，沒有利益。但前進不會有咎害，只是稍微有所困擾。 \n\
 \n\
九四：非常吉祥，沒有咎害。這是因為位居中正，不會受到影響。 \n\
 \n\
九五：形成聚集並且處於恰當的位置，沒有咎害。雖然不夠虔誠，但仍然可以永久保持正道，無需後悔。 \n\
 \n\
上六：充滿悲傷，淚水洶湧，但沒有咎害。這是因為處於不安定的上位。 \n\
 \n\
",
"[hexa] 大有 \n\
 \n\
大有卦 火天大有 離上乾下 \n\
 \n\
大有：元亨。 \n\
 \n\
《彖》曰：大有，柔得尊位，大中而上下應之，曰大有。其德剛健而文明，應乎天而時行， 是以元亨。 \n\
 \n\
《象》曰：火在天上，大有。君子以遏惡揚善，順天休命。 \n\
 \n\
初九：無交害，匪咎，艱則無咎。  《象》曰：大有初九，無交害也。 \n\
九二：大車以載，有攸往，無咎。  《象》曰：大車以載，積中不敗也。 \n\
九三：公用亨於天子，小人弗克。  《象》曰：公用亨於天子，小人害也。 \n\
九四：匪其彭，無咎。    《象》曰：匪其彭，無咎，明辨晰也。 \n\
六五：厥孚交如，威如，吉。      《象》曰：厥孚交如，信以發志也。威如之吉，易而無備也。 \n\
上九：自天佑之，吉無不利。      《象》曰：大有上吉，自天佑也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
大有卦：非常豐盛的卦象，表示元亨通達。 \n\
 \n\
《彖》解說：大有卦，表示柔順得到崇高的位置，大體均衡而上下和諧，稱之為大有。其德性剛健而文明，能應乎天命，因此具有元亨通達之意。 \n\
 \n\
《象》說：火在天上，為大有卦的象徵。君子應當制止邪惡，推崇善行，順應天命，安心度日。 \n\
 \n\
初九：無往來害怕，沒有過失，面對艱難狀況也沒有過失。象徵大有卦初九，表示無往來害怕。 \n\
 \n\
九二：使用大車來載物，有所前進，沒有過失。這是因為大車能積載物品，能在困難中前進而不失敗。 \n\
 \n\
九三：為國家之利運作，小人不能阻撓。表示大有卦九三，為國家之利運作，小人不能阻撓。 \n\
 \n\
九四：不因著自己的驕傲而有過失。這是因為不自恃己長而過於驕傲，所以沒有過失。 \n\
 \n\
六五：彼此的信任如此之深厚，威嚴顯赫，吉祥。表示大有卦六五，彼此的信任深厚，威嚴顯赫，為吉祥之兆。 \n\
 \n\
上九：自天而獲得祐佑，吉祥，一切都順利無阻。表示大有卦上九，自天而獲得祐佑，吉祥。 \n\
 \n\
",
"[hexa] 睽 \n\
 \n\
睽卦 火澤睽 離上兌下 \n\
 \n\
睽：小事吉。 \n\
 \n\
《彖》曰：睽，火動而上，澤動而下。二女同居，其志不同行；說而麗乎明，柔進而上行， 得中而應乎剛。是以小事吉。天地睽而其事同也，男女睽而其志通也，萬物睽而其事類也。睽之時用大矣哉！ \n\
 \n\
《象》曰：上火下澤，睽。君子以同而異。 \n\
 \n\
初九：悔亡，喪馬勿逐，自復。見惡人，無咎。      《象》曰：見惡人，以辟咎也。 \n\
九二：遇主於巷，無咎。  《象》曰：遇主於巷，未失道也。 \n\
六三：見輿曳，其牛掣，其人天且劓，無初有終。    《象》曰：見輿曳，位不當也。無初有終，遇剛也。 \n\
九四：睽孤，遇元夫。交孚，厲無咎。      《象》曰：交孚無咎，志行也。 \n\
六五：悔亡，厥宗噬膚，往何咎？  《象》曰：厥宗噬膚，往有慶也。 \n\
上九：睽孤，見豕負塗，載鬼一車。先張之弧，後說之弧。匪寇婚媾，往遇雨則吉。      《象》曰：遇雨之吉，群疑亡也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
睽卦：小事順利。 \n\
 \n\
《彖》解說：睽卦，火往上升，澤往下流。兩女同處，志向不同；雖然和諧美好，柔順前進而往上行，能夠中得剛的應和。因此，小事順利。天地睽離，但事物的運行卻是相通的，男女雖然各自有異，但志向卻是相通的，萬物雖然各異，但事物類似。睽卦的時機運作是非常重要的！ \n\
 \n\
《象》說：上面是火，下面是澤，這就是睽卦的象徵。君子應當在相同中尋找不同。 \n\
 \n\
初九：懊悔消失，丟失馬不要去追，自己就能恢復。遇到邪惡的人，沒有災禍。《象》說：遇到邪惡的人，是為了避免災禍。 \n\
 \n\
九二：在巷道遇到主人，沒有災禍。《象》說：在巷道遇到主人，是因為沒有迷失道路。 \n\
 \n\
六三：看見車子被拉，牛被拖，人天生懷惡念，雖然沒有一開始就有結局。《象》說：看見車子被拉，是因為位置不當。雖然沒有一開始就有結局，是因為遇到了剛健的對象。 \n\
 \n\
九四：睽離而孤單，卻遇到了有道德的人。互相信任，雖然有危險但沒有災禍。《象》說：互相信任而沒有災禍，是因為志向是相通的。 \n\
 \n\
六五：懊悔消失，宗廟被咬傷，前進會有何災？《象》說：宗廟被咬傷，前進會有喜慶。 \n\
 \n\
上九：離離孤單，看見豬被塗污，拉著鬼一輛車。先張弓，再發射弓箭。不是敵寇，而是婚媾。前進遇到雨就吉利。《象》說：遇到雨的吉利，是因為眾人的疑慮消散。 \n\
 \n\
",
"[hexa] 離 \n\
 \n\
離卦 離為火 離上離下 \n\
 \n\
離：利貞，亨。畜牝牛，吉。 \n\
 \n\
《彖》曰：離，麗也。日月麗乎天，百穀草木麗乎土。重明以麗乎正，乃化成天下。柔麗乎 中正，故亨，是以畜牝牛吉也。 \n\
 \n\
《象》曰：明兩作，離。大人以繼明照於四方。 \n\
 \n\
初九：履錯然，敬之無咎。        《象》曰：履錯之敬， 以辟咎也。 \n\
六二：黃離，元吉。      《象》曰：黃離元吉，得中道也。 \n\
九三：日昃之離，不鼓缶而歌，則大耋之嗟，凶。    《象》曰：日昃之離，何可久也。 \n\
九四：突如其來如，焚如，死如，棄如。    《象》曰：突如其來如，無所容也。 \n\
六五：出涕沱若，戚嗟若，吉。    《象》曰：六五之吉，離王公也。 \n\
上九：王用出征，有嘉。折首，獲其匪醜，無咎。    《象》曰：王用出征，以正邦也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
離卦：吉祥，通達。養育母牛，吉利。 \n\
 \n\
《彖》解說：離卦，代表陽光明媚。太陽和月亮照耀著天空，百穀草木在土地上茂盛生長。這種光明的力量通達於天地之間，化育成為天下萬物。在柔和中顯現光明和正義，因此通達，所以養育母牛是吉利的。 \n\
 \n\
《象》說：陽光兩者共同作用，這就是離卦的形象。偉大的人物應該像太陽一樣照耀四方。 \n\
 \n\
初九：踏錯腳步，但保持敬意就沒有災禍。《象》說：踏錯腳步但能保持敬意，是為了避免災禍。 \n\
 \n\
六二：黃色離卦，極為吉利。《象》說：黃色離卦極為吉利，是因為取得中道。 \n\
 \n\
九三：太陽西沈，不擊鼓不歌唱，這樣老者將感嘆，凶險。《象》說：太陽西沈，不能持久。 \n\
 \n\
九四：忽然而來，像火一樣燃燒，死亡般，被放棄。《象》說：忽然而來，沒有可以容忍的地方。 \n\
 \n\
六五：如淚水般湧出，悲戚的嘆息，但吉利。《象》說：六五的吉利，是因為離卦的王公地位。 \n\
 \n\
上九：國王使用軍隊征戰，有喜悅。斬首，獲得非凡的成就，沒有災禍。《象》說：國王使用軍隊征戰，是為了正治國家。 \n\
 \n\
 \n\
",
"[hexa] 噬嗑 \n\
 \n\
噬嗑卦 火雷噬嗑 離上震下 \n\
 \n\
噬嗑：亨。利用獄。 \n\
 \n\
《彖》曰：頤中有物曰噬嗑。噬嗑而亨，剛柔分，動而明，雷電合而章。柔得中而上行， 雖不當位，利用獄也。 \n\
 \n\
《象》曰：雷電噬嗑。先王以明罰敕法。 \n\
 \n\
初九：履校滅趾，無咎。  《象》曰：履校滅趾，不行也。 \n\
六二：噬膚滅鼻，無咎。  《象》曰：噬膚滅鼻，乘剛也。 \n\
六三：噬臘肉，遇毒。小吝，無咎。        《象》曰：遇毒，位不當也。 \n\
九四：「噬乾胏，得金矢。利艱貞，吉。    《象》曰：利艱貞吉，未光也。 \n\
六五，噬乾肉得黃金。貞厲，無咎。        《象》曰：貞厲無咎，得當也。 \n\
上九：何校滅耳，凶。    《象》曰：何校滅耳，聰不明也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
噬嗑卦：通達。利於執行判決。 \n\
 \n\
《彖》解說：口中含有物稱為噬嗑。噬嗑而通達，剛和分明，行動而清晰，雷與電交相呼應而表現出來。柔和得到中位而上升，雖然位置不正確，但利於執行判決。 \n\
 \n\
《象》說：雷電相互交響，這是噬嗑卦的形象。先王以明晰的懲罰和頒布法律來治理國家。 \n\
 \n\
初九：行走謹慎，消除矛盾，沒有災禍。《象》說：行走謹慎，不可前進。 \n\
 \n\
六二：噬咬肌膚，摧毀鼻子，沒有災禍。《象》說：噬咬肌膚，摧毀鼻子，乘著剛強。 \n\
 \n\
六三：噬嗑臘肉，遇到毒物。小的困擾，但沒有災禍。《象》說：遇到毒物，位置不正確。 \n\
 \n\
九四：噬嗑乾胏，得到金箭。利於堅守正道，吉利。《象》說：利於堅守正道，吉利，是因為對的位置。 \n\
 \n\
六五：噬嗑乾肉，得到黃金。堅守正道會有危險，但沒有災禍。《象》說：堅守正道會有危險，但沒有災禍，因為是合適的。 \n\
 \n\
上九：為何啃咬並摧毀耳朵，凶險。《象》說：為何啃咬並摧毀耳朵，是因為聽而不明晰。 \n\
 \n\
",
"[hexa] 鼎 \n\
 \n\
鼎卦 火風鼎 離上巽下 \n\
 \n\
鼎：元吉，亨。 \n\
 \n\
《彖》曰：鼎，象也。以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖賢。巽而耳目聰 明，柔進而上行，得中而應乎剛，是以元亨。 \n\
 \n\
《象》曰：木上有火，鼎。君子以正位凝命。 \n\
 \n\
初六：鼎顛趾，利出否。得妾以其子，無咎。        《象》曰：鼎顛趾，未悖也。利出否，以從貴也。 \n\
九二：鼎有實，我仇有疾，不我能即，吉。  《象》曰：鼎有實，慎所之也。我仇有疾，終無尤也。 \n\
九三：鼎耳革，其行塞，雉膏不食。方雨，虧悔，終吉。      《象》曰：鼎耳革，失其義也。 \n\
九四：鼎折足，覆公餗，其形渥，凶。      《象》曰：覆公餗，信如何也？ \n\
六五：鼎黃耳金鉉，利貞。        《象》曰：鼎黃耳，中以為實也。 \n\
上九：鼎玉鉉，大吉，無不利。    《象》曰：玉鉉在上，剛柔節也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
鼎卦：大吉祥，亨通。 \n\
 \n\
《彖》解說：鼎，是象徵的意象。以木巽火，烹調而亨通。聖人利用鼎來獻祭上帝，而大亨通則是用來養育聖賢。巽而耳目聰明，柔和而進取，得到中位而應和剛強，因此具有大吉祥的特質。 \n\
 \n\
《象》說：木在上面燃燒著火，形成了鼎。君子應當堅守正位，凝定自己的使命。 \n\
 \n\
初六：鼎翻覆，腳掛在趾上，有利於出去，娶妾生子，沒有災禍。《象》說：鼎翻覆，但未走入錯誤，有利於出去，是為了跟隨高貴者。 \n\
 \n\
九二：鼎裡有實物，我的仇敵患了病，但不能即刻向我襲來，吉祥。《象》說：鼎裡有實物，應當謹慎前往。我的仇敵患了病，最終沒有災禍。 \n\
 \n\
九三：鼎的耳朵換上新的，行動受阻，雉的脂肪不能吃。這是在方降雨的時候，會有損失，最終吉祥。《象》說：鼎的耳朵換上新的，失去了原有的正義。 \n\
 \n\
九四：鼎的足部折斷，覆蓋著公餗，形狀浮腫，凶險。《象》說：覆蓋著公餗，誠實如何？ \n\
 \n\
六五：鼎的黃色耳朵裝上金製的鉉，利於正道貞固。《象》說：鼎的黃色耳朵，中間裝上實物。 \n\
 \n\
上九：鼎用玉製的鉉，大吉大利，一切無不順利。《象》說：玉製的鉉在上，剛柔節制。 \n\
 \n\
",
"[hexa] 未濟 \n\
 \n\
未濟：亨。小狐汔濟，濡其尾，無攸利。 \n\
 \n\
《彖》曰：未濟，亨；柔得中也。小狐汔濟，未出中也。濡其尾，無攸利；不續終也。雖不 當位，剛柔應也。 \n\
 \n\
《象》曰：火在水上，未濟。君子以慎辨物居方。 \n\
 \n\
初六：濡其尾，吝。      《象》曰：濡其尾，亦不知極也。 \n\
九二：曳其輪，貞吉。    《象》曰：九二貞吉，中以行正也。 \n\
六三：未濟，徵凶，利涉大川。    《象》曰：未濟徵凶，位不當也。 \n\
九四：貞吉，悔亡，震用伐鬼方。三年有賞於大國。  《象》曰：貞吉悔亡，志行也。 \n\
六五：貞吉，無悔。君子之光，有孚，吉。  《象》曰：君子之光，其暉吉也。 \n\
上九：有孚於飲酒，無咎。濡其首，有孚失是。      《象》曰：飲酒濡首，亦不知節也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
未濟卦：亨通。小狐濔濔地渡過河流，沾濡了尾巴，沒有好處。 \n\
 \n\
《彖》解說：未濟卦，亨通，因為柔弱的陽爻適中。小狐濔濔地渡過河流，尚未走出中位，沾濡了尾巴，沒有好處，不能持續到終點。雖然位置不正確，但剛柔得當。 \n\
 \n\
《象》說：火在水上，代表未濟。君子應當慎重辨別物務，使其處於正確的位置。 \n\
 \n\
初六：沾濡了尾巴，有困難。《象》說：沾濡了尾巴，表示不知節制。 \n\
 \n\
九二：拖著車輪前進，貞吉。《象》說：九二貞吉，因為中正而行。 \n\
 \n\
六三：未濟，徵兆凶險，但有利於渡過大河。《象》說：未濟徵兆凶險，因為位置不當。 \n\
 \n\
九四：貞吉，悔亡，震動用伐鬼方，三年有功績於大國。《象》說：貞吉悔亡，是因為志向堅定。震動用伐鬼方，表示三年之內在大國有所成就。 \n\
 \n\
六五：貞吉，無悔。君子之光芒，有誠信，吉祥。《象》說：君子之光芒，是因為光輝吉祥。 \n\
 \n\
上九：真誠對待飲酒，沒有災禍。濡濕了頭部，真誠對待卻失敗。《象》說：飲酒濡濕了頭部，表示不知節制。 \n\
 \n\
",
"[hexa] 旅 \n\
 \n\
旅卦 火山旅 離上艮下 \n\
 \n\
旅：小亨，旅貞吉。 \n\
 \n\
《彖》曰：旅，小亨。柔得中乎外，而順乎剛，止而麗乎明，是以小亨，旅貞吉也。旅之時 義大矣哉！ \n\
 \n\
《象》曰：山上有火，旅。君子以明慎用刑而不留獄。 \n\
 \n\
初六：旅瑣瑣，斯其所取災。      《象》曰：旅瑣瑣，志窮災也。 \n\
六二：旅即次，懷其資，得童僕，貞。      《象》曰：得童僕貞，終無尤也。 \n\
九三：旅焚其次，喪其童僕，貞厲。        《象》曰：旅焚其次，亦以傷矣。以旅與下，其義喪也。 \n\
九四：旅於處，得其資斧，我心不快。      《象》曰：旅於處，未得位也。得其資斧，心未快也。 \n\
六五：射雉，一矢亡，終以譽命。  《象》曰：終以譽命，上逮也。 \n\
上九：鳥焚其巢，旅人先笑後號咷。喪牛於易，凶。  《象》曰：以旅在上，其義焚也。喪牛於易，終莫之聞也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
旅卦：小亨通，旅行保持正確的心態吉祥。 \n\
 \n\
《彖》解說：旅卦，小亨通。柔弱的陽爻在外得中，順應剛爻，停頓而美麗。因此小亨通，旅行保持正確的心態吉祥。旅行的時機真是非常良好啊！ \n\
 \n\
《象》說：山上有火，形成旅卦。君子應當明智地使用刑法，不讓囚犯長時間關押。 \n\
 \n\
初六：旅途艱難，困苦不斷，這樣的前程將帶來災禍。《象》說：旅途艱難，志向受阻，災禍來臨。 \n\
 \n\
六二：旅途次第前進，心懷物資，得到少年僕人，保持正確的心態。《象》說：得到少年僕人保持正確的心態，最終沒有過錯。 \n\
 \n\
九三：旅途中火燒次序，失去少年僕人，保持正確的心態會帶來危險。《象》說：旅途中火燒次序，也因此受傷害。與下卦旅相應，意味著道義喪失。 \n\
 \n\
九四：在旅途中落腳處，得到資斧，但我心不悅快。《象》說：在旅途中落腳處，仍未得到應有的位置。雖然得到資斧，但心情未能舒暢。 \n\
 \n\
六五：射擊山雉，用一箭擊敗，最終以光榮的名聲保全性命。《象》說：最終以光榮的名聲，高居巔峰。 \n\
 \n\
上九：焚燒鳥巢，旅人先是歡笑後來哭號。在易經占卜中喪失牛，將帶來凶險。《象》說：以旅在上，這樣的行為引發火災。在易經中，喪失牛，結局無人知曉。 \n\
 \n\
",
"[hexa] 晉 \n\
 \n\
晉卦 火地晉 離上坤下 \n\
 \n\
晉：康侯用錫馬蕃庶，晝日三接。 \n\
 \n\
《彖》曰：晉，進也。明出地上，順而麗乎大明。柔進而上行，是以康侯用錫馬蕃庶，晝日 三接也。 \n\
 \n\
《象》曰：明出地上，晉。君子以自昭明德。 \n\
 \n\
初六：晉如，摧如，貞吉。罔孚，裕無咎。  《象》曰：晉如摧如，獨行正也。裕無咎，未受命也。 \n\
六二：晉如，愁如，貞吉。受茲介福，於其王母。    《象》曰：受茲介福，以中正也。 \n\
六三：眾允，悔亡。      《象》曰：眾允之志，上行也。 \n\
九四：晉如碩鼠，貞厲。  《象》曰：碩鼠貞厲，位不當也。 \n\
六五：悔亡，失得勿恤，往吉，無不利。    《象》曰：失得勿恤，往有慶也。 \n\
上九：晉其角，維用伐邑。厲吉無咎，貞吝。        《象》曰：維用伐邑，道未光也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
晉卦：康侯使用錫金以賞賜馬匹，繁衍眾多，白天三次接見。 \n\
 \n\
《彖》解說：晉卦，表示前進。太陽明亮地出現在地上，光芒順暢且美麗。柔弱的陽爻向前推進，上行，因此康侯使用錫金賞賜馬匹，繁衍眾多，每天晝間三次接見。 \n\
 \n\
《象》說：太陽明亮地出現在地上，這就是晉卦的卦象。君子應當自我展現明亮的美德。 \n\
 \n\
初六：前進似乎困難，有阻礙，但保持正確的心態吉祥。不要心存疑慮，這樣就能免受災禍。《象》說：前進似乎困難，有阻礙，但獨自行走是正確的。不要心存疑慮，因為還未受到使命。 \n\
 \n\
六二：前進似乎令人愁苦，但保持正確的心態吉祥。接受這份福德，歸屬於王母。《象》說：接受這份福德，以中正之德。 \n\
 \n\
六三：眾人一致同行，悔恨消失。《象》說：眾人一致的心志，向上行進。 \n\
 \n\
九四：前進如同大而老的老鼠，貞兆危險。《象》說：老鼠貞兆危險，位置不當。 \n\
 \n\
六五：悔恨消失，失去和獲得都不必懷疑，前進吉祥，一切都利益無懈可擊。《象》說：失去和獲得都不必懷疑，前進會有喜慶。 \n\
 \n\
上九：前進而有角度，用以征伐城邑，危險吉祥，保持正確的心態會有困難。《象》說：用以征伐城邑，表示道路還未照亮。 \n\
 \n\
",
"[hexa] 大壯 \n\
 \n\
大壯卦 雷天大壯 震上乾下 \n\
 \n\
大壯：利貞。 \n\
 \n\
《彖》曰：大壯，大者壯也。剛以動，故壯。大壯利貞，大者正也。正大而天地之情可見矣！ \n\
 \n\
《象》曰：雷在天上，大壯。君子以非禮弗履。 \n\
 \n\
初九：壯於趾，徵凶，有孚。      《象》曰：壯於趾，其孚窮也。 \n\
九二：貞吉。    《象》曰：九二貞吉，以中也。 \n\
九三：小人用壯，君子用罔，貞厲。羝羊觸藩，羸其角。      《象》曰：小人用壯，君子罔也。 \n\
九四：貞吉悔亡，藩決不羸，壯於大輿之輹。        《象》曰：藩決不羸，尚往也。 \n\
六五：喪羊於易，無悔。  《象》曰：喪羊於易，位不當也。 \n\
上六：羝羊觸藩，不能退，不能遂，無攸利，艱則吉。        《象》曰：不能退，不能遂，不祥也。艱則吉，咎不長也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
大壯卦：有力的雷聲在天上響起，是為大壯。有利於堅守正道。 \n\
 \n\
《彖》解說：大壯，表示大而有力。剛健而有所動，所以壯大。大壯有利於堅守正道，因為正大而有力，此時天地之情可見矣！ \n\
 \n\
《象》說：雷在天上，大壯。君子應當遵循禮節，不可踐踏它。 \n\
 \n\
初九：足下壯盛，徵兆凶險，但充滿誠信。《象》說：足下壯盛，誠信可靠，但處境危險。 \n\
 \n\
九二：堅守正道吉祥。《象》說：九二堅守正道吉祥，因為居中守正。 \n\
 \n\
九三：小人依靠有力，君子以不踐踏禮節，堅守正道會有危險。羝羊觸到籬笆，折斷了角。《象》說：小人依靠有力，君子應當避免踐踏禮節。 \n\
 \n\
九四：堅守正道吉祥，懺悔過錯可免。籬笆已經破裂，不再束縛。大車被壯大地固定。《象》說：籬笆破裂，但還能堅守正道，尚可前進。 \n\
 \n\
六五：在易卦中喪失羊，無悔。《象》說：在易卦中喪失羊，是因為位置不當。 \n\
 \n\
上六：羝羊觸到籬笆，無法後退，也無法前進，沒有利益可言，只有艱難之中可能帶來吉祥。《象》說：不能後退，也不能前進，是不吉祥的象徵。在艱難之中可能帶來吉祥，但過錯不會長久。 \n\
 \n\
 \n\
",
"[hexa] 歸妹 \n\
 \n\
歸妹卦 雷澤歸妹 震上兌下 \n\
 \n\
歸妹：徵凶，無攸利。 \n\
 \n\
《彖》曰：歸妹，天地之大義也。天地不交而萬物不興。歸妹，人之終始也。說以動，所歸 妹也。徵凶，位不當也。無攸利，柔乘剛也。 \n\
 \n\
《象》曰：澤上有雷，歸妹。君子以永終知敝。 \n\
 \n\
初九：歸妹以娣，跛能履，徵吉。  《象》曰：歸 妹以娣，以恆也。跛能履，吉相承也。 \n\
九二：眇能視，利幽人之貞。      《象》曰：利幽人之貞，未變常也。 \n\
六三：歸妹以須，反歸以娣。      《象》曰：歸妹以須，未當也。 \n\
九四：歸妹愆期，遲歸有時。      《象》曰：愆期之志，有待而行也。 \n\
六五：帝乙歸妹，其君之袂不如其娣之袂良，月幾望，吉。    《象》曰：帝乙歸妹，不如其娣之袂良也。其位在中，以貴行也。 \n\
上六：女承筐無實，士刲羊無血，無攸利。  《象》曰：上六無實，承虛筐也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
歸妹卦：預示有凶險，無所獲益。 \n\
 \n\
《彖》解說：歸妹卦體現了天地間的大道。天地不交合，萬物就無法興旺。歸妹代表人的終始過程，是以歸妹象徵結局。有言論而行動，所以稱為歸妹。徵凶，是因為卦爻的位置不當。無所獲益，表示柔弱者被強者所掌握。 \n\
 \n\
《象》說：澤上有雷，形成歸妹卦。君子應當在永遠不變的道理中，明白結局的來臨。 \n\
 \n\
初九：嫁出女兒，妹妹效力，能夠履行，徵兆吉祥。《象》說：嫁出女兒，希望她能有恆心。雖然腳跛，但仍能履行，吉祥會接連而來。 \n\
 \n\
九二：視力微弱，有利於隱居的人堅守正道。《象》說：有利於隱居的人堅守正道，表示未變的常道。 \n\
 \n\
六三：希望女兒速嫁，卻反而嫁出女兒效力。《象》說：希望女兒速嫁，但情況並不適合。 \n\
 \n\
九四：女兒婚期過了，晚婚也是有時機的。《象》說：過了婚期，但適當的時機還會來臨。 \n\
 \n\
六五：帝乙娶女兒，他的袍裾不如娣的袍裾華麗，這是吉祥之兆。《象》說：帝乙娶女兒，但他的袍裾不如娣的袍裾華麗，這是因為娣的位置在中間，所以顯得更貴重。 \n\
 \n\
上六：女子持空筐，士人切羊不見血，無所獲益。《象》說：上六持空筐，是在承載虛空。 \n\
 \n\
 \n\
",
"[hexa] 豐 \n\
 \n\
豐卦 雷火 豐震上離下 \n\
 \n\
豐：亨。王假之，勿憂，宜日中。 \n\
 \n\
《彖》曰：豐，大也。明以動，故豐。王假之，尚大也。勿憂，宜日中，宜照天下也。日中則 昃，月盈則食。天地盈虛，與時消息，而況於人乎？況於鬼神乎？ \n\
 \n\
《象》曰：雷電皆至，豐。君子以折獄致刑。 \n\
 \n\
初九：遇其配主，雖旬無咎，往有尚。      《象》曰： 雖旬無咎，過旬災也。 \n\
六二：豐其蔀，日中見鬥。往得疑疾，有孚發若，吉。        《象》曰：有孚發若，信以發志也。 \n\
九三：豐其沛，日中見昧，折其右肱，無咎。        《象》曰：豐其沛，不可大事也。折其右肱， 終不可用也。 \n\
九四：豐其蔀，日中見鬥，遇其夷主，吉。  《象》曰：豐其蔀，位不當也。日中見鬥， 幽不明也。遇其夷主，吉行也。 \n\
六五：來章，有慶譽，吉。        《象》曰：六五之吉，有慶也。 \n\
上六：豐其屋，蔀其家，窺其戶，闃其無人，三歲不覿，凶。  《象》曰：豐其屋，天際翔也。窺其戶，闃其無人，自藏也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
豐卦：順利通達。王者寬大慷慨，不必擔憂，適宜處於正午的陽光之下。 \n\
 \n\
《彖》解說：豐，表示豐盛之大。陽光明朗而有動力，所以是豐盛的象徵。王者慷慨大度，有容納萬物之意，不必擔憂。宜處於正午陽光之下，這樣可以照亮天下。正午時陽光直射，月亮圓滿則是食時，天地充實與虛空，隨著時間的流轉變動，何況是對於人和神靈呢？ \n\
 \n\
《象》說：雷電齊至，大豐盈。君子應當折獄而施刑。 \n\
 \n\
初九：遇上了應對的主位，雖然需要等待十天，但沒有災禍，前進會有好的結果。《象》說：雖然需要等待十天，但過了十天就會有災禍。 \n\
 \n\
六二：豐盛了谷物庫藏，正午時見到鬥戰。前進會有疑慮和困難，但有誠實的表現，吉利。《象》說：有誠實的表現，表示有信心發揮志氣。 \n\
 \n\
九三：豐盛了盈滿的水，正午時見到昧。折斷右臂，沒有災禍。《象》說：盈滿的水表示無法有大的作為。折斷右臂，終究無法使用。 \n\
 \n\
九四：豐盛了谷物庫藏，正午時見到鬥戰。遇到了夷族的領主，吉利。《象》說：蓄積得太多，位置不當。正午時見到鬥戰，暗示幽暗而不明朗。遇到夷族的領主，表示前進是吉祥的。 \n\
 \n\
六五：進入宮殿，得到慶賀和贊譽，吉利。《象》說：六五之吉，是因為有慶賀之事。 \n\
 \n\
上六：屋宇非常富裕，谷倉豐滿。窺探居室的門戶，卻發現裡面空無一人。三年不見，凶險。《象》說：屋宇非常富裕，飛天的樣子。窺探居室的門戶，卻發現裡面空無一人，自己躲藏著。 \n\
 \n\
",
"[hexa] 雷 \n\
 \n\
震為雷 震上震下 \n\
 \n\
震：亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。 \n\
 \n\
《彖》曰：震，亨。震來虩虩，恐致福也。笑言啞啞，後有則也。震驚百里，驚遠而懼邇也。出可以守宗廟社稷，以為祭主也。 \n\
 \n\
《象》曰：洊雷，震。君子以恐懼修身。 \n\
 \n\
初九：震來虩虩，後笑言啞啞，吉。        《象》曰： 震來虩虩，恐致福也。笑言啞啞，後有則也。 \n\
六二：震來厲，億喪貝，躋於九陵，勿逐，七日得。  《象》曰：震來厲，乘剛也。 \n\
六三：震蘇蘇，震行無眚。        《象》曰：震蘇蘇，位不當也。 \n\
九四：震遂泥。  《象》曰：震遂泥，未光也。 \n\
六五：震往來厲，億無喪，有事。  《象》曰：震往來厲，危行也。其事在中，大無喪也。 \n\
上六：震索索，視矍矍，徵凶。震不於其躬，於其鄰，無咎。婚媾有言。        《象》曰：震索索，未得中也。雖凶無咎，畏鄰戒也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
震卦：順利通達。雷震來得恐懼，笑言謙和。雷震驚動百里，但不失去重要的器具。 \n\
 \n\
《彖》解說：震卦，通達順利。雷震而來使人害怕，但這樣的恐懼可能會帶來福慶。笑言謙和，表示後來者會讓路。雷震驚動百里，是害怕遠處而懼怕附近。雷出現可以守護宗廟和社稷，為祭祀之主。 \n\
 \n\
《象》說：雷擊打，震動。君子應當害怕，修身養性。 \n\
 \n\
初九：雷震而來使人害怕，但後來者謙和謙和，吉利。《象》說：雷震而來使人害怕，但這樣的恐懼可能會帶來福慶。後來者謙和謙和，表示後有善者。 \n\
 \n\
六二：雷震而來有威嚴，但卻因失去貝而遭受損失。爬上九陵山，不要追逐，七天之內就會找回。《象》說：雷震而來有威嚴，因而需要謹慎。躋上九陵山，是在逆境中堅守。不要追逐，七天之內就會找回，是一種等待時機的表現。 \n\
 \n\
六三：雷震而顯得恢復生機，行動無咎。《象》說：雷震而顯得恢復生機，但位置不當。 \n\
 \n\
九四：雷震使人陷入泥濘之中。《象》說：雷震使人陷入泥濘之中，未能光大。 \n\
 \n\
六五：雷震來去有威嚴，但不會有損失，有事可做。《象》說：雷震來去有威嚴，表示危險的行動。有事可做，大事不會有損失。 \n\
 \n\
上六：雷震得到消息，視而不動，這是凶兆。雷震並非出於自身，而是來自鄰里，所以沒有災禍。有婚姻的言論。《象》說：雷震得到消息，視而不動，表示未能取得中位。雖然凶兆但無災禍，是因為畏懼鄰里而謹慎。 \n\
 \n\
 \n\
 \n\
",
"[hexa] 恆 \n\
 \n\
恆卦 雷風恆 震上巽下 \n\
 \n\
恆：亨，無咎，利貞。利有攸往。 \n\
 \n\
《彖》曰：恆，久也。剛上而柔下。雷風相與，巽而動，剛柔皆應，恆。恆亨，無咎，利貞； 久於其道也。天地之道，恆久而不已也。利有攸往，終則有始也。日月得天而能久照，四時變化而能久成，聖人久於其道而天下化成。觀其所恆，而天地萬物之情可見矣！ \n\
 \n\
《象》曰：雷風，恆。君子以立不易方。 \n\
 \n\
初六：浚恆，貞凶，無攸利。      《象》曰：浚恆之凶，始求深也。 \n\
九二：悔亡。    《象》曰：九二悔亡，能久中也。 \n\
九三：不恆其德，或承之羞，貞吝。        《象》曰：不恆其德，無所容也。 \n\
九四：田無禽。  《象》曰：久非其位，安得禽也？ \n\
六五：恆其德，貞。婦人吉，夫子凶。      《象》曰：婦人貞吉，從一而終也。夫子制義，從婦凶也。 \n\
上六：振恆，凶。        《象》曰：振恆在上，大無功也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
恆卦：通達，無咎，有利於正道。利於前往。 \n\
 \n\
《彖》解說：恆，表示久持不變。卦象上卦為剛，下卦為柔。雷風相激，巽卦行動，剛柔相應，恆卦通達，無咎，有利於正道，是因為它持久於其道。天地之道是恆久而不變的，四時變化是能久成的，聖人持久於其道，天下也能逐漸化成。觀察其中的穩定性，可以理解天地和萬物的情況。 \n\
 \n\
《象》說：雷風之下，表示恆。君子應當堅定不移地立於正道之上。 \n\
 \n\
初六：挖掘恆定，貞凶，無利可圖。《象》說：挖掘恆定而不變，開始尋求更深的地方，結果凶險。 \n\
 \n\
九二：悔亡，沒有懊悔。《象》說：九二悔亡，表明能持久地居中。 \n\
 \n\
九三：道德不恆定，可能會招來羞辱，貞兆不吉。《象》說：道德不恆定，無法受容。 \n\
 \n\
九四：田中沒有禽鳥。《象》說：久居非其位，怎麼可能獲得禽鳥呢？ \n\
 \n\
六五：持守正道，貞吉。婦人可以吉祥，夫子則凶險。《象》說：婦人持守正道，貞吉，因為她能堅守一而終。夫子制定義，卻持久於女性，故而凶險。 \n\
 \n\
上六：振動不安，凶險。《象》說：振動不安在上位，大事難有所成就。 \n\
 \n\
",
"[hexa] 解 \n\
 \n\
解卦 雷水解 震上坎下 \n\
 \n\
解：利西南，無所往，其來復吉。有攸往，夙吉。 \n\
 \n\
《彖》曰：解，險以動，動而免乎險，解。解利西南，往得眾也。其來復吉，乃得中也。有攸往，夙吉，往有功也。天地解而雷雨作，雷雨作而百果草木皆甲坼。解之時義大矣哉。 \n\
 \n\
《象》曰：雷雨作，解。君子以赦過宥罪。 \n\
 \n\
初六：無咎。    《象》曰：剛柔之際，義無咎也。 \n\
九二：田獲三狐，得黃矢，貞吉。  《象》曰：九二貞吉，得中道也。 \n\
六三：負且乘，致寇至，貞吝。    《象》曰：負且乘，亦可醜也。自我致戎，又誰咎也。 \n\
九四：解而拇，朋至斯孚。        《象》曰：解而拇，未當位也。 \n\
六五：君子維有解，吉，有孚於小人。      《象》曰：君子有解，小人退也。 \n\
上六：公用射隼於高墉之上，獲之無不利。  《象》曰：公用射隼，以解悖也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
解卦：利於西南方向，目前無法前進，但往後轉，吉利。有所前進，早晨吉利。 \n\
 \n\
《彖》解說：解卦，表示在困難中保持行動，通過行動而避免危險，這就是解。解卦利於西南方向，前進可以獲得眾人的支持，後來轉回來也是吉利的。有所前進，早晨就吉利，表明前進會有所成就。天地解凍，雷雨產生，雷雨作用下，百果草木都能生長。解卦的時機意義很大。 \n\
 \n\
《象》說：雷雨作，解卦。君子應該宽恕過失，寬容罪過。 \n\
 \n\
初六：沒有咎。《象》說：在剛柔交替的邊緣，正義無咎。 \n\
 \n\
九二：在田野中獲得三隻狐狸，得到黃色的箭，貞吉。《象》說：九二貞吉，因為得到中正之道。 \n\
 \n\
六三：肩負重擔而騎馬前進，致使敵寇到來，貞吝。《象》說：肩負重擔而騎馬前進，這樣的行動不合適，自招敵寇，誰也難免受到指責。 \n\
 \n\
九四：解開鞋帶，有朋友到來，這是真誠的表現。《象》說：解開鞋帶，位置不當。 \n\
 \n\
六五：君子能夠解卦，吉利，有誠信於小人。《象》說：君子能夠解卦，小人自然會退讓。 \n\
 \n\
上六：用公用的方法射箭擊中鷹隼，獲得它，無不利。《象》說：用公用的方法射箭，解除不合適的狀況。 \n\
 \n\
 \n\
",
"[hexa] 小過 \n\
 \n\
小過卦 雷山小過 震上艮下 \n\
 \n\
小過：亨，利貞。可小事，不可大事。飛鳥遺之音。不宜上，宜下，大吉。 \n\
 \n\
《彖》曰：小過，小者過而亨也。過以利貞，與時行也。柔得中，是以小事吉也。剛失位而 不中，是以不可大事也。有飛鳥之象焉，有飛鳥遺之音。不宜上，宜下，大吉，上逆而下順 也。 \n\
 \n\
《象》曰：山上有雷，小過；君子以行過乎恭，喪過乎哀，用過乎儉。 \n\
 \n\
初六：飛鳥以凶。        《象》曰：飛鳥以凶，不可如何也。 \n\
六二：過其祖，遇其妣。不及其君，遇其臣。無咎。  《象》曰：不及其君，臣不可過也。 \n\
九三：弗過防之，從或戕之，凶。  《象》曰：從或戕之，凶如何也。 \n\
九四：無咎。弗過遇之，往厲必戒，勿用永貞。      《象》曰：弗過遇之，位不當也。往厲必戒，終不可長也。 \n\
六五：密雲不雨，自我西郊。公弋取彼在穴。        《象》曰：密雲不雨，已上也。 \n\
上六：弗遇過之，飛鳥離之，凶，是謂災眚。        《象》曰：弗遇過之，已亢也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
小過卦：亨通，利於堅守正道。適合小事，不宜涉足大事。猶如飛鳥的音聲，不宜上升，應該下降，這樣將大吉大利。 \n\
 \n\
《彖》解說：小過卦，表示小過之處可以通達，有利於堅守正道。小事可行，大事不可輕嘗。柔和能夠居中，所以小事可以順利。剛強失去應有的位置，不能居中，因此不宜嘗試大事。有飛鳥的形象，飛鳥留下的音聲。不宜上行，應該下行，大吉大利，上行逆勢而下行順勢。 \n\
 \n\
《象》說：山上有雷，形成小過的卦象。君子應當在行動中過於恭敬，失敗時過於悲哀，使用時要過於節儉。 \n\
 \n\
初六：飛鳥以凶。《象》說：飛鳥以凶，表示行動不當，可能帶來凶險。 \n\
 \n\
六二：超越祖父，遇到母親。未及到君王，遇到臣子。沒有咎。《象》說：未及到君王，臣子不能超越。 \n\
 \n\
九三：不加防範，隨意行動可能招致凶險。《象》說：隨意行動可能招致凶險，如何可以無咎呢。 \n\
 \n\
九四：沒有咎害。不超越而遇到他，前進雖然有厲害，但一定要謹慎，不可長久保持堅守。《象》說：不超越而遇到他，表示位置不當。 \n\
 \n\
六五：密雲不雨，自己處於西郊。公卿出動，獲得藏於穴中的獵物。《象》說：密雲不雨，表示已經到了極點。 \n\
 \n\
上六：不超越而遇到他，飛鳥離去，凶險，這叫做災禍。《象》說：不超越而遇到他，已經太過於強硬。 \n\
 \n\
 \n\
",
"[hexa] 豫 \n\
 \n\
豫卦 雷地豫 震上坤下 \n\
 \n\
豫：利建侯行師。 \n\
 \n\
《彖》曰：豫，剛應而志行，順以動，豫。豫，順以動，故天地如之，而況建侯行師乎！天 地以順動，故日月不過而四時不忒。聖人以順動，則刑罰清而民服。豫之時義大矣哉！ \n\
 \n\
《象》曰：雷出地奮，豫。先王以作樂崇德，殷薦之上帝，以配祖考。 \n\
 \n\
初六：鳴豫，凶。        《象》曰：初六鳴豫，志窮凶也。 \n\
六二：介於石，不終日，貞吉。    《象》曰：不終日，貞吉；以中正也。 \n\
六三：盱豫，悔。遲有悔。        《象》曰：盱豫有悔，位不當也。 \n\
九四：由豫，大有得。勿疑，朋盍簪。      《象》曰：由豫大有得，志大行也。 \n\
六五：貞疾，恆不死。    《象》曰：六五貞疾，乘剛也。恆不死，中未亡也。 \n\
上六：冥豫，成有渝，無咎。      《象》曰：冥豫在上，何可長也？ \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
豫卦：利於建立侯王，進軍作戰。 \n\
 \n\
《彖》解說：豫卦，表現剛強應變而志向行動，順應而動，這就是豫。順應而動，正如天地之道，更何況是建立侯王進軍作戰呢？天地運行順暢，所以陰陽交替、四季不失其序。聖人效法順應而動，刑罰公正，百姓服從。豫的時機和義理之大，不言而喻。 \n\
 \n\
《象》說：卦形象是雷從地上冒出，表示豫。先王效法這個卦象，以樂舞祭祀，表達敬虔之意，並向上帝禱告，以配合祖宗的祭祀。 \n\
 \n\
初六：雷聲豫備，凶險。《象》說：初六的雷聲是為了預備，表明志向已經陷入困境，凶險。 \n\
 \n\
六二：脚踏在石上，不停留一整天，貞吉。《象》說：脚踏在石上，表示行動中止，但不停留整天，貞吉，因為處於中位而正確。 \n\
 \n\
六三：仰望天空的雷聲，會有懊悔，遲疑而後悔。《象》說：仰望天空的雷聲，會有懊悔，因為位置不當。 \n\
 \n\
九四：出發豫行，大有所得。不要猶豫，朋友已經聚集，將得到好的結果。《象》說：出發豫行，大有所得，因為志向強大。 \n\
 \n\
六五：貞疾，但能持之以恆，則必不死。《象》說：六五貞疾，乘著堅強而不屈。持之以恆，表示持續努力，必定不致於死亡。 \n\
 \n\
上六：在昏暗中凝視雷聲，成就有所差異，但不會有害。《象》說：在昏暗中凝視雷聲，表示已經到達極點，不宜再進一步。 \n\
 \n\
 \n\
",
"[hexa] 小畜 \n\
 \n\
小畜卦 風天小畜 巽上乾下 \n\
 \n\
小畜：亨。密雲不雨，自我西郊。 \n\
 \n\
《彖》曰：小畜；柔得位而上下應之，曰小畜。健而巽，剛中而志行，乃亨。密雲不雨， 尚往也。自我西郊，施未行也。 \n\
 \n\
《象》曰：風行天上，小畜。君子以懿文德。 \n\
 \n\
初九：復自道，何其咎？吉。      《象》曰：復自道， 其義吉也。 \n\
九二：牽復，吉。        《象》曰：牽復在中，亦不自失也。 \n\
九三：輿說輻，夫妻反目。        《象》曰：夫 妻反目，不能正室也。 \n\
六四：有孚，血去惕出，無咎。    《象》曰：有孚惕出，上合志也。 \n\
九五：有孚攣如，富以其鄰。      《象》曰：有孚攣如，不獨富也。 \n\
上九：既雨既處，尚德載。婦貞厲。月幾望，君子徵凶。      《象》曰：既雨既處，德積載也。 君子徵凶，有所疑也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
小畜卦：亨通的象徵。雖有密雲未雨，但仍然在西郊。 \n\
 \n\
《彖》解說：小畜卦象徵柔順得位，上下相應，這就是小畜。柔順而不失剛強，中正而志向堅定，因此亨通。雖然密雲未能化為雨水，但仍然是往上移動的象徵。自我處於西郊，意味著施展力量尚未展開。 \n\
 \n\
《象》說：風行於天上，是小畜的卦象。君子應當培養美好的文德。 \n\
 \n\
初九：自我恢復正道，這樣有何過失？吉利。《象》說：自我恢復正道，其義吉利。 \n\
 \n\
九二：帶領大家恢復，吉利。《象》說：帶領大家恢復，處於中位，不會自失。 \n\
 \n\
九三：輿車解說，夫妻反目。《象》說：夫妻反目，無法維持正常的家室。 \n\
 \n\
六四：有誠實之心，血液澄清，無咎。《象》說：有誠實之心，離去害怕，上合志向。 \n\
 \n\
九五：有真誠之心，與鄰里和睦相處。《象》說：有真誠之心，不僅自己富足，也能使鄰里和睦。 \n\
 \n\
上九：雨水已經降臨，居住在良好位置。婦人貞疾。月亮幾近滿，君子推測出凶兆。《象》說：雨水已經降臨，德行已積載。君子推測出凶兆，表示有疑慮。 \n\
 \n\
",
"[hexa] 中孚 \n\
 \n\
中孚卦 風澤中孚 巽上兌下 \n\
 \n\
中孚：豚魚，吉，利涉大川，利貞。 \n\
 \n\
《彖》曰：中孚，柔在內而剛得中。說而巽，孚乃化邦也。豚魚吉，信及豚魚也。利涉大 川，乘木舟虛也。中孚以利貞，乃應乎天也。 \n\
 \n\
《象》曰：澤上有風，中孚。君子以議獄緩死。 \n\
 \n\
初九：虞吉，有它不燕。  《象》曰：初九虞吉， 志未變也。 \n\
九二：鳴鶴在陰，其子和之。我有好爵，吾與爾靡之。        《象》曰：其子和之，中心願也。 \n\
六三：得敵，或鼓或罷，或泣或歌。        《象》曰：可鼓或罷，位不當也。 \n\
六四：月幾望，馬匹亡，無咎。    《象》曰：馬匹亡，絕類上也。 \n\
九五：有孚攣如，無咎。  《象》曰：有孚攣如，位正當也。 \n\
上九：翰音登於天，貞凶。        《象》曰：翰音登於天，何可長也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
中孚卦：出於澤上有風，為中孚之卦，象徵誠信。 \n\
 \n\
《彖》解說：中孚卦，內部柔軟而能保持堅定，表示柔而得中。能真誠地說明事實，順從而又能巽讓，使誠信之風能化育邦國。「豚魚吉」是指誠信的風語及於豚魚，利於和睦。利涉大川，乘著木舟是虛心的象徵。中孚卦以誠信取信於天，因而得以利貞。 \n\
 \n\
《象》說：澤上有風，中孚。君子應當像澤上的風一樣，廣大無私，平等輕柔，這樣就能審慎地判斷獄案，減緩刑罰。 \n\
 \n\
初九：事情發展順利，但還有其他事情無法達成。《象》說：初九事情發展順利，是因為其志願尚未改變。 \n\
 \n\
九二：鳴鶴在深沉的陰隱之中，它的幼雛也能共鳴和諧。我將擁有高尚的酒器，我和你分享我豐富的酒。《象》說：它的幼雛也能共鳴和諧，是因為中心的願望。 \n\
 \n\
六三：遇到敵人，有時挑釁有時罷手，有時哭泣有時歌唱。《象》說：可鼓或罷，是因為處境不當。 \n\
 \n\
六四：月亮已經近滿，馬匹迅速亡散，但無大的災害。《象》說：馬匹迅速亡散，是因為脫離了上面的類似者。 \n\
 \n\
九五：真誠的感受相互連結，沒有災禍。《象》說：真誠的感受相互連結，因為位置得當。 \n\
 \n\
上九：像鳥兒的音樂升華至天上，但仍然凶險。《象》說：像鳥兒的音樂升華至天上，何以長久。 \n\
 \n\
",
"[hexa] 家人 \n\
 \n\
家人卦 風火家人 巽上離下 \n\
 \n\
家人：利女貞。 \n\
 \n\
《彖》曰：家人，女正位乎內，男正位乎外。男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父，子子，兄兄，弟弟，夫夫，婦婦，而家道正，正家而天下定矣。 \n\
 \n\
《象》曰：風自火出，家人。君子以言有物而行有恆。 \n\
 \n\
初九：閒有家，悔亡。    《象》曰：閒有家，志未變也。 \n\
六二：無攸遂，在中饋。貞吉      《象》曰：六二之吉，順以巽也。 \n\
九三：家人嗃嗃，悔厲吉；婦子嘻嘻，終吝。        《象》曰：家人嗃嗃，未失也。婦子嘻嘻，失家節也。 \n\
六四：富家，大吉。      《象》曰：富家大吉，順在位也。 \n\
九五：王假有家，勿恤，吉。      《象》曰：王假有家，交相愛也。 \n\
上九：有孚威如，終吉。  《象》曰：威如之吉，反身之謂也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
家人卦：風生火，為家人之卦，象徵家庭和睦。 \n\
 \n\
《彖》解說：家人卦中，男女各自處於正確的位置，男性在外，女性在內，體現了天地之大義。家庭中有父母的嚴格管理，是父母的責任。各層次的親戚關係，如父父、子子、兄兄、弟弟、夫夫、婦婦，都合乎正常的規範，使家庭和順，從而能夠穩定天下。 \n\
 \n\
《象》說：風生火，為家人之象。君子應當言談有物，行為有恆。 \n\
 \n\
初九：安靜守家，懺悔過錯，將無悔恨。《象》說：安靜守家，是因為志向尚未改變。 \n\
 \n\
六二：無所追求，居於正中，進贈對方，吉祥。《象》說：六二之吉，是因為順應而巽順。 \n\
 \n\
九三：家庭中有爭吵，懺悔過錯，結局將吉祥；婦女之笑，最終會帶來厄運。《象》說：家人發生爭吵，但還未失去理智；婦女之笑，終究會失去家庭的節制。 \n\
 \n\
六四：家道富裕，大吉大利。《象》說：家道富裕，大吉大利，是因為合乎正位。 \n\
 \n\
九五：君王居於家中，無需憂慮，吉祥。《象》說：君王居於家中，表示家庭成員相互愛護。 \n\
 \n\
上九：威嚴如王者，最終吉祥。《象》說：威嚴如王者，最終帶來吉祥，是指以德服人，自我反省。 \n\
 \n\
 \n\
",
"[hexa] 益 \n\
 \n\
益卦 風雷益 巽上震下 \n\
 \n\
益：利有攸往，利涉大川。 \n\
 \n\
《彖》曰：益，損上益下，民說無疆。自上下下，其道大光。利有攸往，中正有慶。利涉大 川，木道乃行。益動而巽，日進無疆。天施地生，其益無方。凡益之道，與時偕行。 \n\
 \n\
《象》曰：風雷，益。君子以見善則遷，有過則改。 \n\
 \n\
初九：利用為大作，元吉，無咎。  《象》曰：元吉無咎，下不厚事也。 \n\
六二：或益之十朋之龜，弗克違。永貞吉。王用享於帝，吉。  《象》曰：或益之，自外來 也。 \n\
六三：益之用凶事，無咎。有孚中行，告公用圭。    《象》曰：益用凶事，固有之也。 \n\
六四：中行，告公從，利用為依遷國。      《象》曰：告公從，以益志也。 \n\
九五：有孚惠心，勿問元吉。有孚惠我德。  《象》曰：有孚惠心，勿問之矣。惠我德，大得志也。 \n\
上九：莫益之，或擊之，立心勿恆，凶。    《象》曰：莫益之，偏辭也。或擊之，自外來也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
益卦：巽卦上震卦下，象征上下相应，互相促进。 \n\
 \n\
《彖》解说：益卦，表示損減在上，益增在下，人民互通無疆。自上而下，道路明亮。利有攸往，中正有喜悅。利於涉越大河，木道得以通行。益卦中，動而巽，日進無疆。天象施於地，生生不息，其益無止境。凡事增益的道路，應與時同行。 \n\
 \n\
《象》说：風雷相應，為益卦。君子應當看到善行就改變，有過錯就主動改正。 \n\
 \n\
初九：利用做大事，大吉大利，無咎。《象》说：大吉大利，無咎，是因為不過分厚道。 \n\
 \n\
六二：或者為了益增，將十個朋友贈送的龜，不能不接受。永遠堅守正道，吉利。君王如果把這些龜獻給天子，是吉祥的。《象》说：或者益增，自外而來。 \n\
 \n\
六三：為了增加益處而參與兇事，雖然無咎。誠實而行，告訴公眾，使用玉器正義也。《象》说：益用凶事，是因為確實有道理。 \n\
 \n\
六四：持中而行，告訴公眾跟隨著，利於支持移居他國。《象》说：告訴公眾跟隨著，以益增志向。 \n\
 \n\
九五：真心實意做好事，不要問吉凶。真心實意幫助我的道德，這樣做對我是吉祥的。《象》说：真心實意做好事，不要問吉凶。 \n\
 \n\
上九：不要再去增加，或者攻擊增加的事物，保持心志不變，會有凶險。《象》说：不要再去增加，或者攻擊增加的事物，是偏激的言論。 \n\
 \n\
",
"[hexa] 巽 \n\
 \n\
巽卦 巽為風 巽上巽下 \n\
 \n\
巽：小亨。利有攸往，利見大人。 \n\
 \n\
《彖》曰：重巽以申命。剛巽乎中正而志行。柔皆順乎剛，是以小亨，利有攸往，利見大 人。 \n\
 \n\
《象》曰：隨風，巽。君子以申命行事。 \n\
 \n\
初六：進退，利武人之貞。        《象》曰：進退，志疑也。 利武人之貞，志治也。 \n\
九二：巽在床下，用史巫紛若，吉，無咎。  《象》曰：紛若之吉，得中也。 \n\
九三：頻巽，吝。        《象》曰：頻巽之吝，志窮也。 \n\
六四：悔亡，田獲三品。  《象》曰：田獲三品，有功也。 \n\
九五：貞吉，悔亡，無不利。無初有終。先庚三日，後庚三日，吉。    《象》曰：九五之吉，位 正中也。 \n\
上九：巽在床下，喪其資斧，貞凶。        《象》曰：巽在床下，上窮也。喪其資斧，正乎凶也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
巽卦：巽卦象征風，上下皆為巽卦。 \n\
 \n\
《彖》解說：巽卦代表了順從風的特性，表現為小亨通。重巽以申明命令。剛強的性質要遵從中正，志向要有所行動。柔順的態度適應剛強的性格，因此小事可通達，利於有所行動，有見識的人看到會有好處。 \n\
 \n\
《象》說：隨著風的吹動，這是巽卦的卦象。君子應當通過申明命令來執行事務。 \n\
 \n\
初六：進退猶豫，利於武人堅守正道。《象》說：進退猶豫，是因為志向有疑慮。堅守正道，對武人有利，表現出志向的治理。 \n\
 \n\
九二：巽在床下，像是巫覡占卜紛亂一樣，吉利，無咎。《象》說：紛亂一樣的吉利，是因為取得了中位。 \n\
 \n\
九三：頻繁地改變態度，會有困難。《象》說：頻繁地改變態度，會有困難，表現出志向的窮困。 \n\
 \n\
六四：悔恨消失，得到了三品的封爵。《象》說：得到了三品的封爵，表現出有所成就。 \n\
 \n\
九五：守正得吉利，悔恨消失，無所不利。沒有開始而結束，先庚三日，後庚三日，吉利。《象》說：九五之吉利，是因為處在正中的位置。 \n\
 \n\
上九：巽在床下，失去了其資擋，貞凶。《象》說：巽在床下，處在極盡困境的位置。失去了其資擋，正處於凶險之中。 \n\
 \n\
 \n\
 \n\
",
"[hexa] 渙 \n\
 \n\
渙卦 風水渙 巽上坎下 \n\
 \n\
渙：亨。王假有廟。利涉大川，利貞。 \n\
 \n\
《彖》曰：渙，亨。剛來而不窮，柔得位乎外而上同。王假有廟，王乃在中也。利涉大川， 乘木有功也。 \n\
 \n\
《象》曰：風行水上，渙。先王以享於帝，立廟。 \n\
 \n\
初六：用拯馬壯，吉。    《象》曰：初六之吉，順 也。 \n\
九二：渙奔其機，悔亡。  《象》曰：渙奔其機，得願也。 \n\
六三：渙其躬，無悔。    《象》曰：渙其躬，志在外也。 \n\
六四：渙其群，元吉。渙有丘，匪夷所思。  《象》曰：渙其群，元吉，光大也。 \n\
九五：渙汗，其大號渙，王居，無咎。      《象》曰：王居無咎，正位也。 \n\
上九：渙其血，去逖出，無咎。    《象》曰：渙其血，遠害也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
渙卦：渙卦象征散去，風行水上。 \n\
 \n\
《彖》解說：渙卦表現為亨通。剛健而來卻不致穷盡，柔弱卻得到外部的位置而上進，王者才能這樣行動。王者建廟，取得正中的位置。利於渡過大河，利於堅守正道。 \n\
 \n\
《象》說：風行水上，就像是水的表面風吹開，先王就是這樣享受帝王的福祉，並建立了廟宇。 \n\
 \n\
初六：用來挽救馬力，吉利。《象》說：初六的吉利，是因為從順而來。 \n\
 \n\
九二：水流快速而機會來臨，悔恨消失。《象》說：水流快速而機會來臨，得到了心願。 \n\
 \n\
六三：自我解散，不會悔恨。《象》說：自我解散，是因為心志在外。 \n\
 \n\
六四：散去群眾，最終吉利。渙有丘，這不是一個平凡的想法。《象》說：散去群眾，最終吉利，表現出光大的效應。 \n\
 \n\
九五：汗水散去，大呼小叫，王者安居，沒有悔恨。《象》說：王者安居，沒有悔恨，這是因為處在正確的位置。 \n\
 \n\
上九：散去自己的血液，逃避至遠處，沒有悔恨。《象》說：散去自己的血液，逃避至遠處，是為了遠離危險。 \n\
 \n\
",
"[hexa] 漸 \n\
 \n\
漸卦 風山漸 巽上艮下 \n\
 \n\
漸：女歸吉，利貞。 \n\
 \n\
《彖》曰：漸之進也，女歸吉也。進得位，往有功也。進以正，可以正邦也。其位剛得中 也。止而巽，動不窮也。 \n\
 \n\
《象》曰：山上有木，漸。君子以居賢德善俗。 \n\
 \n\
初六：鴻漸於乾，小子厲，有言，無咎。    《象》曰：小子之厲，義無咎也。 \n\
六二：鴻漸於磐，飲食衍衍，吉。  《象》曰：飲食衍衍，不素飽也。 \n\
九三：鴻漸於陸。夫徵不復，婦孕不育，凶。利御寇。        《象》曰：夫徵不復，離群醜也。婦孕不育，失其道也。利用御寇，順相保也。 \n\
六四：鴻漸於木，或得其桷，無咎。        《象》曰：或得其桷，順以巽也。 \n\
九五：鴻漸於陵，婦三歲不孕，終莫之勝，吉。      《象》曰：終莫之勝，吉，得所願也。 \n\
上九：鴻漸於逵，其羽可用為儀，吉。      《象》曰：其羽可用為儀吉，不可亂也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
漸卦：漸卦象征漸進，風行山上。 \n\
 \n\
《彖》解說：漸卦的進展是有利的，特別對女性。進展能夠得到正確的位置，行動會有成就。正確而進取，能夠正直治理國家。卦象中的位置剛好取得中正之地，堅守而且能夠靈活行動。 \n\
 \n\
《象》說：山上有木，漸。君子應當堅持良好的品德，培養良好的風俗。 \n\
 \n\
初六：大雁漸至乾隆，小孩有危險，有言但無咎。《象》說：小孩的危險是由於正義行動而來，這樣的行動是正確的。 \n\
 \n\
六二：大雁飛到高山，飲食簡單而吉利。《象》說：飲食簡單，不要太飽，這樣會是吉祥的。 \n\
 \n\
九三：大雁漸至陸地，男徵不返，女孕不育，凶險。利用征伐侵略。《象》說：男徵不返，離群醜也。女孕不育，迷失正道。利用征伐，順應相互保護。 \n\
 \n\
六四：大雁漸至樹木，或獲得枝條，沒有悔恨。《象》說：或獲得枝條，順應而巽，因此沒有悔恨。 \n\
 \n\
九五：大雁漸至山陵，女性三年不懷孕，最終無法超越，吉祥。《象》說：最終無法超越，吉祥，達到了所希望的。 \n\
 \n\
上九：大雁漸至逵路，其羽毛可以用來做祭祀的器具，吉祥。《象》說：其羽毛可以用來做祭祀的器具，吉祥，這是為了避免混亂。 \n\
 \n\
 \n\
",
"[hexa] 觀 \n\
 \n\
觀卦 風地觀 巽上坤下 \n\
 \n\
觀：盥而不薦，有孚顒若。 \n\
 \n\
《彖》曰：大觀在上，順而巽，中正以觀天下，觀。盥而不薦，有孚顒若，下觀而化也。觀 天之神道，而四時不忒。聖人以神道設教，而天下服矣。 \n\
 \n\
《象》曰：風行地上，觀。先王以省方觀民設教 \n\
 \n\
初六：童觀，小人無咎，君子吝。  《象》曰：初六童觀，小人道也。 \n\
六二：窺觀，利女貞。    《象》曰：窺觀女貞，亦可醜也。 \n\
六三：觀我生，進退。    《象》曰：觀我生進退，未失道也。 \n\
六四：觀國之光，利用賓於王。    《象》曰：觀國之光，尚賓也。 \n\
九五：觀我生，君子無咎。        《象》曰：觀我生，觀民也。 \n\
上九：觀其生，君子無咎。        《象》曰：觀其生，志未平也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
觀卦：觀卦象征觀察、審視，風行地上。 \n\
 \n\
《彖》解說：大觀在上，順應而巽順，中正以觀察天下，這就是觀卦的含義。卦象中，上卦巽為風，下卦坤為地，風行地上，以觀察世界的變化。觀卦的核心是觀天之神道，以此為基礎來設立教化。這也表明，觀卦蘊含着觀察世界的智慧，並以此智慧來引導人們。 \n\
 \n\
《象》說：風行地上，猶如觀察世界。先王以此觀察方圓，觀察民情，並設立教化。 \n\
 \n\
初六：小孩在觀察，小人沒有災害，君子有所忌憚。《象》說：初六小孩在觀察，是因為小人的行為。 \n\
 \n\
六二：窺視觀察，對女性有利。《象》說：窺視觀察，女性保持正直是可醜的。 \n\
 \n\
六三：觀察自己的成長，進退有度。《象》說：觀察自己的成長，進退有度，沒有失去正道。 \n\
 \n\
六四：觀察國家的光明，有利於事奉國王。《象》說：觀察國家的光明，尚且可以獻策於君王。 \n\
 \n\
九五：觀察自己的成長，君子沒有災害。《象》說：觀察自己的成長，表明君子能夠觀察民情。 \n\
 \n\
上九：觀察自己的成長，君子沒有災害。《象》說：觀察自己的成長，是因為心志未平。 \n\
 \n\
",
"[hexa] 需 \n\
 \n\
需卦 水天需 坎上乾下 \n\
 \n\
需：有孚，光亨，貞吉。利涉大川。 \n\
 \n\
《彖》曰：需，須也，險在前也。剛健而不陷，其義不困窮矣。需有孚，光亨，貞吉。位乎 天位，以正中也。利涉大川，往有功也。 \n\
 \n\
《象》曰：雲上於天，需。君子以飲食宴樂。 \n\
 \n\
初九：需 於郊，利用恆，無咎。   《象》曰：需於郊，不犯難行也。利用恆，無咎；未失常也。 \n\
九二：需於沙，小有言，終吉。    《象》曰：需於沙，衍在中也。雖小有言，以終吉也。 \n\
九三：需於泥，致寇至。  《象》曰：需於泥，災在外也。自我致寇，敬慎不敗也。 \n\
六四：需於血，出自穴。  《象》曰：需於血，順以聽也。 \n\
九五：需於酒食，貞吉。  《象》曰：酒食貞吉，以中正也。 \n\
上六：入於穴，有不速之客三人 來，敬之終吉。     《象》曰：不速之客來，敬之終吉。雖不當位，未大失也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
需卦：需卦象征等待、需求，坎上乾下，水天需。 \n\
 \n\
《彖》解說：需，即等待、需要。卦象中，乾為天，坎為水，坎上乾下，形成等待的狀態。需表示處在危險的前方，但仍能保持剛健而不陷入困境，其義在於不陷入窮困。卦中有孚，光亨，貞吉，意味着應當保持誠實信任的態度，則能通達光明，貞吉。位居天位，以正中為要。利涉大川，表示前進將會獲得成功。 \n\
 \n\
《象》說：卦形如雲上於天，象征等待的狀態。君子應當以飲食宴樂的態度等待。 \n\
 \n\
初九：在郊外等待，有利於恆久，沒有災害。《象》說：在郊外等待，表示不犯難行，利用恆久，沒有災害，因為保持常道。 \n\
 \n\
九二：在沙灘等待，雖然有一點小的過錯，最終吉祥。《象》說：在沙灘等待，雖然有小的過錯，但最終吉祥，因為這是在中位，雖有小言，終究吉祥。 \n\
 \n\
九三：在泥中等待，將會引來寇敵。《象》說：在泥中等待，災害在外，自我招致寇敵，需要謹慎以免敗亡。 \n\
 \n\
六四：在血液中等待，從穴中出來。《象》說：在血液中等待，順從而應對。 \n\
 \n\
九五：在酒食中等待，貞吉。《象》說：飲食貞吉，表示中正之道。 \n\
 \n\
上六：進入穴中等待，有三個不速之客來，恭敬對待最終吉祥。《象》說：不速之客來，恭敬對待最終吉祥。雖然不在正位，但未有大的失誤。 \n\
 \n\
",
"[hexa] 節 \n\
 \n\
節卦 水澤節 坎上兌下 \n\
 \n\
節：亨。苦節不可貞。 \n\
 \n\
《彖》曰：節，亨。剛柔分而剛得中。苦節不可貞，其道窮也。說以行險，當位以節，中正以通。天地節而四時成。節以制度，不傷財，不害民。 \n\
 \n\
《象》曰：澤上有水，節。君子以制數度，議德行。 \n\
 \n\
初九：不出戶庭，無咎。  《象》曰：不出戶庭，知通塞也。 \n\
九二：不出門庭，凶。    《象》曰：不出門庭凶，失時極也。 \n\
六三：不節若，則嗟若，無咎。    《象》曰：不節之嗟，又誰咎也？ \n\
六四：安節，亨。        《象》曰：安節之亨，承上道也。 \n\
九五：甘節，吉，往有尚。        《象》曰：甘節之吉，居位中也。 \n\
上六：苦節，貞凶，悔亡。        《象》曰：苦節貞凶，其道窮也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
節卦：節卦象征節制，坎上兌下，水澤節。 \n\
 \n\
《彖》解說：節卦，亨通。卦象中，剛柔分開而剛健者居中。苦節卻不能保持正道，表明其道路已經走到了盡頭。節卦以行動應對危險，當處在正位以節制，中正通達。天地之間有節制而四季成就。節卦謀定制度，不損害財富，也不傷害民眾。 \n\
 \n\
《象》說：澤上有水，即節卦。君子應當制定度數，審慎論德行。 \n\
 \n\
初九：不離開戶庭，無咎。《象》說：不離開戶庭，是為了知道通塞。 \n\
 \n\
九二：不離開門庭，凶。《象》說：不離開門庭就會帶來凶險，是因為錯過了時機。 \n\
 \n\
六三：不節若，則嗟若，無咎。《象》說：不節制的態度，則會感歎悔，但不會有咎害。 \n\
 \n\
六四：安節，亨通。《象》說：安節之亨通，是因為承上道。 \n\
 \n\
九五：甘願節制，吉祥，前去是有益的。《象》說：甘願節制是吉祥的，居於中正之位。 \n\
 \n\
上六：苦於節制，貞凶，懊悔消失。《象》說：苦於節制，貞凶，表示道路已經走到了盡頭。 \n\
 \n\
",
"[hexa] 既濟 \n\
 \n\
既濟卦 水火既濟 坎上離下 \n\
 \n\
既濟：亨小，利貞。初吉終亂。 \n\
 \n\
《彖》曰：既濟亨，小者亨也。利貞，剛柔正而位當也。初吉，柔得中也。終止則亂，其道窮也。 \n\
 \n\
《象》曰：水在火上，既濟。君子以思患而預防之。 \n\
 \n\
初九：曳其輪，濡其尾，無咎。    《象》曰： 曳其輪，義無咎也。 \n\
六二：婦喪其茀，勿逐，七日得。  《象》曰：七日得，以中道也。 \n\
九三：高宗伐鬼方，三年克之，小人勿用。  《象》曰：三年克之，憊也。 \n\
六四：繻有衣袽，終日戒。        《象》曰：終日戒，有所疑也。 \n\
九五：東鄰殺牛，不如西鄰之禴祭，實受其福。      《象》曰：東鄰殺牛，不如西鄰之時也。 實受其福，吉大來也。 \n\
上六：濡其首，厲。      《象》曰：濡其首厲，何可久也 \n\
 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《既濟卦》是由坎上卦火下卦組成的卦象。 \n\
 \n\
既濟卦解曰：已經完成，順利而小者有亨通，利於正守。初時吉祥結束時變得混亂。 \n\
 \n\
《彖》說：既濟卦表示事情已經完成，小者已經順利。利於守正，因為剛柔之道得以正位。初時順利，是因為柔順居中。但如果繼續停滯，情勢就會變得混亂，因為事情已經達到盡頭。 \n\
 \n\
《象》說：水在火上，即為既濟。君子應當思患並提前預防。 \n\
 \n\
 \n\
初九爻，拖著車輪，車尾沾濕，沒有災咎。《象傳》曰：拖著車輪，是合乎義理的，所以沒有災咎。 \n\
 \n\
六二爻，婦女丟失了頭飾，不要追趕，七天後會得到。《象傳》曰：七天後會得到，是因為遵循了中正之道。 \n\
 \n\
九三爻，高宗伐鬼方，三年才攻克，小人不可用。《象傳》曰：三年才攻克，是因為疲憊了。 \n\
 \n\
六四爻，穿著有衣領的衣服，終日戒備。《象傳》曰：終日戒備，是因為有所懷疑。 \n\
 \n\
九五爻，東鄰殺牛祭祀，不如西鄰按時祭祀，實際上得到了福報。《象傳》曰：東鄰殺牛祭祀，不如西鄰按時祭祀。實際上得到了福報，是大吉大利的。 \n\
 \n\
上六爻，頭部沾濕，危險。《象傳》曰：頭部沾濕危險，怎麼能夠長久呢？ \n\
 \n\
",
"[hexa] 屯 \n\
 \n\
水雷屯：元亨利貞。勿用有攸往，利建侯。 \n\
 \n\
《彖》曰：屯，剛柔始交而難生。動乎險中，大亨貞。雷雨之動滿盈，天造草昧，宜建侯而 不寧。 \n\
 \n\
《象》曰：雲雷屯，君子以經綸。 \n\
 \n\
初九：磐桓，利居貞，利建侯。	《象》曰：雖磐桓，志行正也。以貴下賤，大得民也。 \n\
六二：屯如邅如，乘馬班如。匪寇，婚媾，女子貞不字，十年乃字。	《象》曰：六二之難，乘剛也。十年乃字，反常也。 \n\
六三：既鹿無虞，惟入於林中。君子幾，不如捨，往吝。	《象》曰：既鹿無虞，以縱禽也。君 子捨之，往吝，窮也。 \n\
六四：乘馬班如，求婚媾，往吉，無不利。	《象》曰：求而往，明也。 \n\
九五：屯其膏，小貞吉，大貞凶。	《象》曰：屯其膏，施未光也。 \n\
上六：乘馬班如，泣血漣如。	《象》曰：泣血漣如，何可長也。 \n\
 \n\
--- \n\
 \n\
屯卦：元始亨通，適合利宜正固。不可輕舉出行，有利於建立侯王。 \n\
 \n\
《彖曰》：屯卦，是剛和柔初交合而難以產生。在動盪的危險之中，大吉大利是正固的表現。雷雨之動充滿了整個天地，象徵著混沌未明的狀態，宜於建立侯王，使社會安寧不動盪。 \n\
 \n\
《象曰》：像雲雷交會的樣子，君子應當以經緯之才智處理事務。 \n\
 \n\
初九：像磐石堅固，有利於守正，也有利於建立侯王。《象曰》：雖然磐石堅固，但其志向正確。應該以尊重上下之心，以取得大眾的支持。 \n\
 \n\
六二：屯卦的位置如同邊緣，行動像乘馬經過險道一樣。不是盜賊，而是結婚聯姻。女子守正，十年才有字。《象曰》：六二的困難在於其堅強。十年才有字，是因為情況反常。 \n\
 \n\
六三：鹿已經沒有危險了，只是進入了林中。君子也是如此，不如此則有困難。《象曰》：鹿已經不再有危險，這是讓禽獸自由活動的象徵。君子應該捨棄這樣的事物，否則將會陷入困境。 \n\
 \n\
六四：乘馬經過險道，尋找婚姻聯姻，前進吉祥，一切皆順利。《象曰》：求而前進，顯示明智之舉。 \n\
 \n\
九五：屯卦聚於其膏，小的吉祥，大的吉凶難定。《象曰》：屯聚於其膏，是指資源尚未充足。施行小規模的正道是吉祥的，但大規模的可能帶來凶險。 \n\
 \n\
上六：乘馬經過險道，淚水如泉湧出。《象曰》：淚水如泉湧出，表明無法長久維持。 \n\
 \n\
 \n\
",
"[hexa] 井 \n\
 \n\
井卦 水風井 坎上巽下 \n\
 \n\
井：改邑不改井，無喪無得。往來井井。汔至亦未繘井，羸其瓶，凶。 \n\
 \n\
《彖》曰：巽乎水而上水，井。井養而不窮也。改邑不改井，乃以剛中也。汔至亦未繘井，未有功也。羸其瓶，是以凶也。 \n\
 \n\
《象》曰：木上有水，井。君子以勞民勸相。 \n\
 \n\
初六：井泥不食，舊井無禽。      《象》曰：井泥不 食，下也。舊井無禽，時捨也。 \n\
九二：井谷射鮒，甕敝漏。        《象》曰：井谷射鮒，無與也。 \n\
九三：井渫不食，為我心惻。可用汲，王明，並受其福。      《象》曰：井渫不食，行惻也。求 王明，受福也。 \n\
六四：井甃，無咎。      《象》曰：井甃無咎，修井也。 \n\
九五：井冽寒泉，食。    《象》曰：寒泉之食，中正也。 \n\
上六：井收勿幕，有孚元吉。      《象》曰：元吉在上，大成也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《井卦》是由坎上卦巽下卦組成的卦象。 \n\
 \n\
井卦解曰：井象徵水源，取之不斷，改變城邑卻不改變井。無所損失也。往來如水井井相通。但若是汲水而未達到井口，瓶子落入井中，這樣就不好了，會帶來凶險。 \n\
 \n\
《彖》說：巽卦應用在水的上方，是井卦。井卦象徵水源，是源源不斷的。改變城邑卻保留了井，是因為其堅固而穩定。但若取水未至井口，也就是未有實質收穫，水只是停留在井中，這樣就會有凶險。 \n\
 \n\
《象》說：樹上有水，是井的象徵。君子應當努力勞動，互相勸勉。 \n\
 \n\
初六：井水混濁不能飲用，舊井沒有野獸。《象》說：井泥不食，是在低處。舊井無禽，是時機已經過去。 \n\
 \n\
九二：在井底射鮒魚，水甕破漏。《象》說：井谷射鮒，但甕已經破裂漏水，沒有用。 \n\
 \n\
九三：井水污濁不能飲用，我感到心痛。可以挖淘清理，君王賢明，眾人都會得到福佑。《象》說：井水已經枯竭不飲，讓人感到憂心。這時候可以用水瓶汲水，是君王聰明明理，將得到福澤。 \n\
 \n\
六四：用磚石修築井壁，沒有災咎。《象》說：井經過修繕，沒有咎害。 \n\
 \n\
九五：井水清澈，寒泉可口，可以飲用。《象》說：冽寒泉之飲，符合中正之道。 \n\
 \n\
上六：收起井口，不要蓋上井蓋，有誠信。《象》說：元吉在上，表示大成就即將實現。 \n\
 \n\
",
"[hexa] 坎 \n\
 \n\
坎卦 坎為水 坎上坎下 \n\
 \n\
坎：習坎，有孚。維心亨。行有尚。 \n\
 \n\
《彖》曰：習坎，重險也。水流而不盈，行險而不失其信。維心亨，乃以剛中也。行有尚， 往有功也。天險，不可升也；地險，山川丘陵也。王公設險以守其國。險之時用大矣哉！ \n\
 \n\
《象》曰：水洊至，習坎。君子以常德行，習教事。 \n\
 \n\
初六：習坎，入於坎窞，凶。      《象》曰：習坎入坎，失道凶也。 \n\
九二：坎有險，求小得。  《象》曰：求小得，未出中也。 \n\
六三：來之坎坎，險且枕，入於坎窞，勿用。        《象》曰：來之坎坎，終無功也。 \n\
六四：樽酒簋貳，用缶，納約自牖，終無咎。        《象》曰：樽酒簋貳，剛柔際也。 \n\
九五：坎不盈，祗既平，無咎。    《象》曰：坎不盈，中未大也。 \n\
上六：系用徽繹，置於叢棘，三歲不得，凶。        《象》曰：上六失道，凶三歲也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《坎卦》是由上下均為坎卦的卦象。 \n\
 \n\
坎卦解曰：學習處理陷入困境的情況，有誠實守信的心，則順利亨通。在行動中要有所謀略。 \n\
 \n\
《彖》說：學習坎卦，意味著面臨重大的危險。水流動而不斷，行動中遇到困境卻不失去誠信。有誠實守信的心，是因為具有剛毅的品質。行動中要有所謀略，這樣才能取得功勞。天有險地不可升，地有險是指山川丘陵。君王要設置險阻來守護國家，這是時刻保持警覺的大事。 \n\
 \n\
《象》說：水流入洼地，是學習坎卦的象徵。君子應當保持恆常的德行，學習教育的事務。 \n\
 \n\
初六：學習坎卦，進入困境而陷入危險，會有凶險。《象》說：學習坎卦進入坎中，失去正道將帶來凶險。 \n\
 \n\
九二：坎卦有險，但是尋求小的收獲，可以得到一些。《象》說：尋求小的收獲，是因為還未走出困境。 \n\
 \n\
六三：來到坎卦陷入困境，險峻且困苦，進入坎中就會失敗。《象》說：來到坎卦陷入困境，最終不會有所成就。 \n\
 \n\
六四：用樽酒和盛飯的器皿二者，選擇剛柔適中的，這樣就不會有咎。《象》說：選擇剛柔適中的樽酒和盛飯器皿，是在剛柔的交接處。 \n\
 \n\
九五：坎卦不盈滿，只是稍微平穩，不會有咎害。《象》說：坎卦不盈滿，表示中間的狀況不是太大。 \n\
 \n\
上六：系住了用來編織繩帶的符節，放在叢棘中，三年無法取得，這樣會帶來凶險。《象》說：上六失去了正道，三年的凶險也因此而來。 \n\
 \n\
",
"[hexa] 蹇 \n\
 \n\
蹇卦 水山蹇 坎上艮下 \n\
 \n\
蹇：利西南，不利東北。利見大人，貞吉。 \n\
 \n\
《彖》曰：蹇，難也，險在前也。見險而能止，知矣哉。蹇利西南，往得中也。不利東北， 其道窮也。利見大人，往有功也。當位貞吉，以正邦也。蹇之時用大矣哉。 \n\
 \n\
《象》曰：山上有水，蹇。君子以反身修德。 \n\
 \n\
初六：往蹇來譽。        《象》曰：往蹇來譽，宜待也。 \n\
六二：王臣蹇蹇，匪躬之故。      《象》曰：王臣蹇蹇，終無尤也。 \n\
九三：往蹇來反。        《象》曰：往蹇來反，內喜之也。 \n\
六四：往蹇來連。        《象》曰：往蹇來連，當位實也。 \n\
九五：大蹇，朋來。      《象》曰：大蹇朋來，以中節也。 \n\
上六：往蹇來碩，吉。利見大人。  《象》曰：往蹇來碩，志在內也。利見大人，以從貴也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《蹇卦》是由坎上艮下組成的卦象。 \n\
 \n\
《蹇卦》解曰：前途艱難，有險阻之勞。利於西南方向，不利於東北。利於見到位高有權勢的人，堅守正道就會吉祥。 \n\
 \n\
《彖》說：《蹇卦》代表艱難，因為危險在前。能夠看到困難而能夠停下，已經算是有智慧了。《蹇卦》利於西南，表示向著中間前進是有益的。不利於東北，這條道路已經走到盡頭。利於見到位高有權勢的人，表示前進會有所成就。在正確的位置上保持正直，就會獲得吉祥。《蹇卦》在這個時候運用很大。 \n\
 \n\
《象》說：山上有水，形成《蹇卦》。君子應當反思自己，修養自己的品德。 \n\
 \n\
初六：往蹇來譽，宜靜待時機。《象》說：往蹇來譽，宜待也。 \n\
 \n\
六二：君臣之間有所阻礙，不是因為自己的錯誤。《象》說：君臣之間有所阻礙，終究不會有過錯。 \n\
 \n\
九三：前進會有困難，但後來可以回來。《象》說：前進會有困難，但後來可以回來，內心感到高興。 \n\
 \n\
六四：前進會有阻礙，但後來會順利。《象》說：前進會有阻礙，但後來會順利，因為在正確的位置上實事求是。 \n\
 \n\
九五：面對巨大的困難，朋友前來幫助。《象》說：面對巨大的困難，朋友前來幫助，因為堅守中道。 \n\
 \n\
上六：前進會很困難，但最終會取得巨大的成功。利於見到位高有權勢的人。《象》說：前進會很困難，但最終會取得巨大的成功，因為志在內心，利於見到位高有權勢的人。 \n\
 \n\
",
"[hexa] 比 \n\
 \n\
比卦 水地比 坎上坤下 \n\
 \n\
比：吉。原筮，元永貞，無咎。不寧方來，後夫凶。 \n\
 \n\
《彖》曰：比，吉也。比，輔也，下順從也。原筮，元永貞，無咎，以剛中也。不寧方來，上 下應也。後夫凶，其道窮也。 \n\
 \n\
《象》曰：地上有水，比。先王以建萬國，親諸侯。 \n\
 \n\
初六：有孚比之，無咎。有孚盈缶，終來有它吉。    《象》曰：比之初六，有它吉也。 \n\
六二：比之自內，貞吉。  《象》曰：比之自內，不自失也。 \n\
六三：比之匪人。        《象》曰：比之匪人，不亦傷乎？ \n\
六四：外比之，貞吉。    《象》曰：外比於賢，以從上也。 \n\
九五：顯比，王用三驅，失前禽。邑人不誡，吉。    《象》曰：顯比之吉，位正中也。捨逆取順，失前禽也。邑人不誡，上使中也。 \n\
上六：比之無首，凶。    《象》曰：比之無首，無所終也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《比卦》是由坎上坤下組成的卦象。 \n\
 \n\
《比卦》解曰：吉祥。若問卜筮，起卦得《比卦》，預示永遠平安，沒有災禍。若問事事如意，前來協助，結果無害。但若前來的是不安分的人，後果將會凶險。 \n\
 \n\
《彖》說：《比卦》預示吉祥。比，表示輔助，下順從。原筮，即占卜問筮，表明一切都會永遠平安，沒有災禍，因為是由堅強的中位而來。不寧方來，上下相應。後來的人如果不安分，結果將會凶險。 \n\
 \n\
《象》說：地上有水，形成《比卦》。先王以此卦為例，建立萬國，親近諸侯。 \n\
 \n\
初六：與人結合，不會有害。若與人共同盛滿的缶，最終會有其他的吉祥。《象》說：初六與人結合，最終會有其他的吉祥。 \n\
 \n\
六二：與自己內在的力量結合，正確的道路會吉祥。《象》說：與自己內在的力量結合，表示不會自己失誤。 \n\
 \n\
六三：與不正派的人結合。《象》說：與不正派的人結合，結果將會有傷害。 \n\
 \n\
六四：與外部優秀的人結合，結果會吉祥。《象》說：與外部優秀的人結合，表示從上面受到引導。 \n\
 \n\
九五：展現結合的力量，君王發動三軍，失去前來的禽鳥，但城邑的人沒有警告，是吉祥的。《象》說：展現結合的力量，君王動員三軍，失去前來的禽鳥，但城邑的人沒有警告，因為上位者引導居中。 \n\
 \n\
上六：結合沒有領導者，凶險。《象》說：結合沒有領導者，表示沒有終點。 \n\
 \n\
",
"[hexa] 大畜 \n\
 \n\
大畜卦 山天大畜 艮上乾下 \n\
 \n\
大畜：利貞，不家食吉，利涉大川。 \n\
 \n\
《彖》曰：大畜，剛健篤實，輝光日新，其德剛上而尚賢。能止健，大正也。不家食吉，養 賢也。利涉大川，應乎天也。 \n\
 \n\
《象》曰：天在山中，大畜。君子以多識前言往行，以畜其德。 \n\
 \n\
初九：有厲，利已。      《象》曰：有厲利已，不犯災也。 \n\
九二：輿說輻。  《象》曰：輿說輻，中無尤也。 \n\
九三：良馬逐，利艱貞。曰閒輿衛，利有攸往。      《象》曰：利有攸往，上合志也。 \n\
六四：童牛之牿，元吉。  《象》曰：六四元吉，有喜也。 \n\
六五：豶豕之牙，吉。    《象》曰：六五之吉，有慶也。 \n\
上九：何天之衢，亨。    《象》曰：何天之衢，道大行也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《大畜卦》是由艮上乾下的卦象所組成。 \n\
 \n\
《大畜卦》解曰：大畜，利於堅守正道，不在家中貪食而有吉祥，有益於涉越大河。 \n\
 \n\
《彖》說：《大畜卦》的爻辭中，大畜象徵剛健、篤實，其德強大，堅守正道，光明日新，其德之堅強而尚且賢明。能夠制止健勇，表現出強大的正確。不在家中貪食而得吉祥，這是要培養賢能的人才。利於涉越大川，是應和天命。 \n\
 \n\
《象》說：《大畜卦》的卦象是山下天上，為大畜。君子應當廣泛學習前人的言行，以豐富自己的知識，並付諸實踐，以培養自己的德行。 \n\
 \n\
初九：有危險，但已經有所準備，利於及時行動。《象》說：有危險，但已經有所準備，這樣就不會招致災禍。 \n\
 \n\
九二：以誠實的言辭和正直的態度說明，中正無尤。《象》說：以誠實的言辭和正直的態度說明，中正無尤。 \n\
 \n\
九三：善用良好的馬匹追逐，利於在困難中守正。言辭說明閒輿衛，有益於前去。《象》說：利於前去，表現出上合志向。 \n\
 \n\
六四：童牛無角，卻充滿元氣，吉祥。《象》說：六四的吉祥，表現出喜悅。 \n\
 \n\
六五：具有野獸的牙齒，吉祥。《象》說：六五的吉祥，表現出慶祝。 \n\
 \n\
上九：走在天之大道，亨通無阻。《象》說：走在天之大道，表示道路暢通。 \n\
 \n\
 \n\
",
"[hexa] 損 \n\
 \n\
損卦 山澤損 艮上兌下 \n\
 \n\
損：有孚，元吉，無咎，可貞。利有攸往。曷之用？二簋可用享。 \n\
 \n\
《彖》曰：損，損下益上，其道上行。損而有孚，元吉，無咎，可貞。利有攸往，曷之用？ 二簋可用享。二簋應有時，損剛益柔有時。損益盈虛，與時偕行。 \n\
 \n\
《象》曰：山下有澤，損。君子以懲忿窒欲。 \n\
 \n\
初九：已事遄往，無咎。酌損之。  《象》曰：已事遄往，尚合志也。 \n\
九二：利貞，徵凶。弗損，益之。  《象》曰：九二利貞，中以為志也。 \n\
六三：三人行則損一人，一人行則得其友。  《象》曰：一人行，三則疑也。 \n\
六四：損其疾，使遄有喜，無咎。  《象》曰：損其疾，亦可喜也。 \n\
六五：或益之十朋之龜，弗克違。元吉。    《象》曰：六五元吉，自上佑也。 \n\
上九：弗損，益之，無咎，貞吉，利有攸往，得臣無家。      《象》曰：弗損益之，大得志也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《損卦》是由艮上兌下的卦象所組成。 \n\
 \n\
《損卦》解曰：損，表示損失，但有誠實守信，是元吉之兆，無咎，可進行正事。利於有所前往。可問：該如何使用？答曰：可以用兩只盛酒的器皿來祭祀。 \n\
 \n\
《彖》說：《損卦》表示在下面損失，上面得益，道路是向上行進的。損而有誠實守信，是元吉之兆，無咎，可進行正事，利於有所前往。該如何使用？答曰：用兩只盛酒的器皿來祭祀。兩只器皿要根據時機而使用，損與益要根據時機而行。損與益之間需要適時地變化，與時偕行。 \n\
 \n\
《象》說：《損卦》的卦象是山下有澤，為損。君子應當懲治憤怒，禁止私慾。 \n\
 \n\
初九：已經事情就趕緊前去，沒有災禍。斟酌損失。《象》說：已經事情就趕緊前去，表示仍然合乎志向。 \n\
 \n\
九二：利於守正，但有凶兆。不損則增益。《象》說：九二利於守正，是由於中正之志。 \n\
 \n\
六三：三人同行就會有損失一人，一人行動就能得到朋友。《象》說：一人行動，三人則疑慮。 \n\
 \n\
六四：損失疾病，使之迅速獲得喜悅，無咎。《象》說：損失疾病，也會有喜悅。 \n\
 \n\
六五：有人犧牲十個朋友的龜，但不克制其損失。元吉。《象》說：六五元吉，是由於上位的力量助益。 \n\
 \n\
上九：不損失，反而增益，無咎，守正吉祥，利於有所前往，雖然失去家室，但能獲得臣下。《象》說：不損失反而增益，大得志向。 \n\
 \n\
 \n\
",
"[hexa] 賁 \n\
 \n\
賁卦 山火賁 艮上離下 \n\
 \n\
賁：亨。小利有所往。 \n\
 \n\
《彖》曰：賁，亨，柔來而文剛，故亨。分剛上而文柔，故小利有攸往，天文也。文明以 止，人文也。觀乎天文，以察時變；觀乎人文，以化成天下。 \n\
 \n\
《象》曰：山下有火，賁。君子以明庶政，無敢折獄。 \n\
 \n\
初九：賁其趾，捨車而徒。        《象》曰：捨車而徒，義弗乘也。 \n\
六二：賁其須。  《象》曰：賁其須，與上興也。 \n\
九三：賁如，濡如，永貞吉。      《象》曰：永貞之吉，終莫之陵也。 \n\
六四：賁如，皤如，白馬翰如，匪寇婚媾。  《象》曰：六四，當位疑也。匪寇婚媾，終無尤也。 \n\
六五：賁於丘園，束帛戔戔。吝，終吉。    《象》曰：六五之吉，有喜也。 \n\
上九：白賁，無咎。      《象》曰：白賁無咎，上得志也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《賁卦》是由艮上離下的卦象所組成。 \n\
 \n\
《賁卦》解曰：賁，通達亨通，小有利於前往。 \n\
 \n\
《彖》說：《賁卦》象徵通達，柔和而文明，因此通達。分剛健在上，而文柔在下，因此小有利於前往，這是符合天文的變化。文明以止，人們應當遵守禮儀法度；觀察天文，以了解時令；觀察人文，以化成天下。 \n\
 \n\
《象》說：山下有火，為賁卦的卦象。君子應當明察庶政，不敢輕舉判斷。 \n\
 \n\
初九：履行者的足指受到裝飾，把車棄置而徒步前進。《象》說：把車棄置而徒步前進，表現了義氣不乘便車的精神。 \n\
 \n\
六二：履行者的鬍鬚受到裝飾。《象》說：鬍鬚受到裝飾，與上位者共興。 \n\
 \n\
九三：光華閃閃，長久堅守正道，吉利。《象》說：長久堅守正道，終莫能陷害。 \n\
 \n\
六四：光華閃閃，潔白如雪的馬，姿態優美，不是強盜，卻能婚配。《象》說：六四處於當位，心中疑慮。不是強盜卻能婚配，終究沒有過失。 \n\
 \n\
六五：履行者來到丘陵的園林，帶著束帛戔戔。吝嗇，但終究吉利。《象》說：六五之吉，有喜悅。 \n\
 \n\
上九：全身皆白潔，無咎。《象》說：全身皆白潔，表示上位者得志達目，無所懷憂。 \n\
 \n\
",
"[hexa] 頤 \n\
 \n\
User \n\
You \n\
頤卦 山雷頤 艮上震下 \n\
 \n\
頤：貞吉。觀頤，自求口實。 \n\
 \n\
《彖》曰：頤，貞吉，養正則吉也。觀頤，觀其所養也。自求口實，觀其自養也。天地養萬 物，聖人養賢以及萬民，頤之時義大矣哉。 \n\
 \n\
《象》曰：山下有雷，頤。君子以慎言語，節飲食。 \n\
 \n\
初九：捨爾靈龜，觀我朵頤，凶。  《象》 曰：觀我朵頤，亦不足貴也。 \n\
六二：顛頤，拂經，於丘頤，徵凶。        《象》曰：六二徵凶，行失類也。 \n\
六三：拂頤，貞凶。十年勿用，無攸利。    《象》曰：十年勿用，道大悖也。 \n\
六四：顛頤，吉。虎視眈眈，其欲逐逐，無咎。      《象》曰：顛頤之吉，上施光也。 \n\
六五：拂經，居貞吉，不可涉大川。        《象》曰：居貞之吉，順以從上也。 \n\
上九：由頤，厲吉。利涉大川。    《象》曰：由頤厲吉，大有慶也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《頤卦》是由艮上震下的卦象所組成。 \n\
 \n\
《頤卦》解曰：頤，貞吉。養正則吉。觀其所養，自求口實。意指堅持正道是吉祥的。觀察自身的養成，追求真實。 \n\
 \n\
《彖》說：頤，貞吉，養正則吉。養正之人得吉祥。觀其所養，指觀察自身的修養。自求口實，即追求真實的內在修養。天地養育萬物，聖人則養育賢者，造福於萬民，這是非常偉大的事。 \n\
 \n\
《象》說：山下有雷，為頤卦的卦象。君子應當謹慎言語，節制飲食。 \n\
 \n\
初九：摒棄你的龜靈，只管觀察我朵起的面頰，結果是凶險的。《象》說：觀察我朵起的面頰，也不足以珍貴。 \n\
 \n\
六二：搖頭擺頤，迷失方向，觀察丘陵的面頰，結果是凶險的。《象》說：六二迷失方向，行動失去規律。 \n\
 \n\
六三：擺動頤部，貞凶。十年不宜行動，無所獲益。《象》說：十年不宜行動，因為行動與正道背離。 \n\
 \n\
六四：擺動頤部，吉利。像虎一樣注視四周，其欲逐逐，無咎。《象》說：擺動頤部的吉利，是因為從上施展光明。 \n\
 \n\
六五：搖動頤部，居貞吉，不可涉越大河。《象》說：居貞之吉，是因為順從於上。 \n\
 \n\
上九：由著頤部，有危險但吉利。利於渡越大河。《象》說：由著頤部而有危險，卻帶來吉慶。 \n\
 \n\
",
"[hexa] 蠱 \n\
 \n\
蠱卦 山風蠱 艮上巽下 \n\
 \n\
蠱：元亨，利涉大川。先甲三日，後甲三日。 \n\
 \n\
《彖》曰：蠱，剛上而柔下，巽而止，蠱。蠱，元亨，而天下治也。利涉大川，往有事也。 先甲三日，後甲三日，終則有始，天行也。 \n\
 \n\
《象》曰：山下有風，蠱。君子以振民育德。 \n\
 \n\
初六：乾父之蠱，有子，考無咎，厲終吉。  《象》曰：乾父之蠱，意承考也。 \n\
九二：乾母之蠱，不可貞。        《象》曰：乾母之蠱，得中道也。 \n\
九三：乾父之蠱，小有晦，無大咎。        《象》曰：乾父之蠱，終無咎也。 \n\
六四：裕父之蠱，往見吝。        《象》曰：裕父之蠱，往未得也。 \n\
六五：乾父之蠱，用譽。  《象》曰：乾父用譽，承以德也。 \n\
上九：不事王侯，高尚其事。      《象》曰：不事王侯，志可則也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《蠱卦》是由艮上巽下的卦象所組成。 \n\
 \n\
《蠱卦》解曰：蠱，元亨，利涉大川。先甲三日，後甲三日。表示強而上，柔而下，風行止息，卦義象徵蠱惑。元亨通達，有利於涉越大川。先行三天，後行三天，表示事情終將有始有終，符合天地運行之道。 \n\
 \n\
《彖》說：《蠱》卦，形上者剛強，形下者柔順，風行而止，這就是蠱卦的卦象。蠱卦象徵元亨，表明天下治理井然有序。利於涉越大川，表示前進會有所成就。先行三天，後行三天，這樣反覆循環，象徵著天地運行的規律。 \n\
 \n\
《象》說：山下有風，形成了蠱卦的卦象。君子應當振興人民，培養德行。 \n\
 \n\
初六：乾卦的父親受到蠱惑，有兒子，考察沒有災咎，危險最終吉祥。解曰：初六乾父之蠱，即意味著初生的子女有所考慮，但無大咎害，這樣的危機最終都能平安結束，結果是吉祥的。象徵蠱惑已經解除。 \n\
 \n\
九二：乾卦的母親受到蠱惑，不可占卜。解曰：九二乾母之蠱，不宜貞定。表示在這樣的情況下，難以持續固定的局面。 \n\
 \n\
九三：乾卦的父親受到蠱惑，稍微有點晦暗，沒有大災咎。解曰：九三乾父之蠱，暗示會遇到一點小的困難，但不至於有大的咎害。表示問題不會引起嚴重後果。 \n\
 \n\
六四：富裕的父親受到蠱惑，前進會遇到吝嗇。解曰：六四裕父之蠱，要往外面看望父親，結果會有困難。表示這樣的行動未能得到順利。 \n\
 \n\
六五：乾卦的父親受到蠱惑，使用譽。解曰：六五乾父之蠱，用譽言行得體。表示在這樣的情境下，憑著美好的評價來行事。 \n\
 \n\
上九：不侍奉王侯，志向高尚。解曰：上九不過問國家大事，把自己的事情做得高尚。表示志向可貴。 \n\
 \n\
 \n\
",
"[hexa] 蒙 \n\
 \n\
蒙卦 山水蒙 艮上坎下 \n\
 \n\
蒙：亨。匪我求童蒙，童蒙求我。初噬告，再三瀆，瀆則不告。利貞。 \n\
 \n\
《彖》曰：蒙，山下有險，險而止，蒙。蒙亨，以亨行時中也。匪我求童蒙，童蒙求我，志 應也。初噬告，以剛中也。再三瀆，瀆則不告，瀆蒙也。蒙以養正，聖功也。 \n\
 \n\
《象》曰：山下出 泉，蒙。君子以果行育德。 \n\
 \n\
初六：發蒙，利用刑人，用說桎梏；以往吝。        《象》曰：利用刑人， 以正法也。 \n\
九二：包蒙，吉。納婦，吉；子克家。      《象》曰：子克家，剛柔接也。 \n\
六三：勿用娶女，見金夫，不有躬，無攸利。        《象》曰：勿用娶女，行不順也。 \n\
六四：困蒙，吝。        《象》曰：困蒙之吝，獨遠實也。 \n\
六五：童蒙，吉。        《象》曰：童蒙之吉，順以巽也。 \n\
上九：擊蒙，不利為寇，利御寇。  《象》曰：利用御寇，上下順也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《蒙卦》是由艮上坎下的卦象所組成。 \n\
 \n\
《蒙卦》解曰：蒙，亨。匪我求童蒙，童蒙求我。初噬告，再三瀆，瀆則不告。利貞。表示通達亨通的狀態。卦辭中提到與童蒙之間的互動，強調了互相學習的過程，尤其強調了謙遜、虛心學習的態度。初時能夠吸收新知，但如果再三沮喪，就無法再得到更多的啟示。在這樣的過程中，保持堅守正道是有利的。 \n\
 \n\
《彖》說：《蒙》卦，山下有險，而停止不前，象徵著亨通的時機降臨。匪我求童蒙，童蒙求我，表示互相學習的心態應該互相匹配，互相應和。初噬告，以剛強的中正之心開始學習。再三瀆，瀆則不告，瀆蒙也，意味著如果不斷沮喪而不再學習，則不會再得到啟示。蒙卦透過學習來養正，有利於聖人的功業。 \n\
 \n\
《象》說：山下湧出泉水，這是蒙卦的卦象。君子應當效法山泉，果斷行動，培養德行。 \n\
 \n\
初六：發蒙，利用刑人，用說桎梏；以往吝。解曰：初六發蒙，初生之意，利用刑法來約束人，並用言語來勸喻，往前走會有困難。表示在發展初期，需要借助一些手段來約束和引導，但如果用力過猛，可能會帶來困難。 \n\
 \n\
九二：包蒙，吉。納婦，吉；子克家。解曰：九二包蒙，吉祥。納婦，吉；子克家，表示這是一個吉利的開端。九二處在艮卦，表示剛柔得中，家庭和睦。 \n\
 \n\
六三：勿用娶女，見金夫，不有躬，無攸利。解曰：六三不宜娶妻。如果見到有錢的男人，卻不能有所作為，就不會有好的結果。表示這個時候，行動不順暢。 \n\
 \n\
六四：困蒙，吝。解曰：六四處於困蒙之中，會有困難。表示在這個位置上，獨自一人前進會陷入實際的困境。 \n\
 \n\
六五：童蒙，吉。解曰：六五處於童蒙之際，吉祥。表示在這個時候，能夠順應時勢，取得好的結果。 \n\
 \n\
上九：擊蒙，不利為寇，利御寇。解曰：上九擊破蒙障，不利於做寇賊，但利於抵禦寇敵。表示這個時候應該擊破蒙昧，但不應當以邪惡的手段去做。 \n\
 \n\
 \n\
",
"[hexa] 艮 \n\
 \n\
艮卦 艮為山 艮上艮下 \n\
 \n\
艮：艮其背，不獲其身，行其庭，不見其人，無咎。 \n\
 \n\
《彖》曰：艮，止也。時止則止，時行則行，動靜不失其時，其道光明。艮其止，止其所 也。上下敵應，不相與也，是以不獲其身。行其庭不見其人，無咎也。 \n\
 \n\
《象》曰：兼山，艮；君子以思不出其位。 \n\
 \n\
初六：艮其趾，無咎。利永貞。    《象》曰：艮其趾， 未失正也。 \n\
六二：艮其腓，不拯其隨，其心不快。      《象》曰：不拯其隨，未退聽也。 \n\
九三：艮其限，列其夤，厲薰心。  《象》曰：艮其限，危薰心也。 \n\
六四：艮其身，無咎。    《象》曰：艮其身，止諸躬也。 \n\
六五：艮其輔，言有序，悔亡。    《象》曰：艮其輔，以中正也。 \n\
上九：敦艮，吉。        《象》曰：敦艮之吉，以厚終也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《艮卦》是由艮上艮下的卦象所組成。 \n\
 \n\
《艮卦》解曰：艮其背，不獲其身，行其庭，不見其人，無咎。表示艮卦的主題是止，靜止的時候停下，行動的時候前進，充分遵從時機。若能保持正確的位置，就不會陷入困境。行動應當遵從時機，並且在靜止和行動之間找到平衡。 \n\
 \n\
《彖》說：艮，止也。時止則止，時行則行，動靜不失其時，其道光明。艮其止，止其所也。上下敵應，不相與也，是以不獲其身。行其庭不見其人，無咎也。說明艮卦的核心是止，適時停止或適時行動，保持平衡和清明。艮卦的特點是上下之間的獨立，不互相牽制，所以不會陷入困境。 \n\
 \n\
《象》說：兼山，艮；君子以思不出其位。艮卦的象徵是兩座山重疊，表示靜止和穩重。君子應當思考，不輕易離開自己的位置，保持恰如其分。 \n\
 \n\
初六：腳趾僵硬，沒有災咎。有利於堅守正道。解曰：初六艮其趾，未失正也。無咎，利於堅守正道，能夠永遠保持純正的品德。 \n\
 \n\
六二：小腿僵硬，不能抓住隨從，心裡不痛快。解曰：六二艮其腓，表示小節制止。不拯其隨，即不遷就任何不當之事，心情不快，但無咎。提示在面對誘惑時要保持節制，避免走上不正確的道路。 \n\
 \n\
九三：大腿僵硬，排列門檻，危險熏灼人心。解曰：九三艮其限，表示節制於極點。列其夤，壓抑而令人不安。厲薰心，心情受到嚴峻的考驗。提醒要謹慎行事，以免造成心靈上的不安。 \n\
 \n\
六四：身體僵硬，沒有災咎。解曰：六四艮其身，表示守身如玉，無咎。保持節制，不貪心，不會有過失。 \n\
 \n\
六五：輔佐僵硬，說話有秩序，沒有悔恨。解曰：六五艮其輔，表示靜止有助於進展。言有序，表達有條理的言論，悔亡。表明這樣的行動是明智的，不會後悔。 \n\
 \n\
上九：敦厚艮卦，吉祥。解曰：上九敦艮，表示在極致處能保持堅守。吉祥。強調在困難時仍能堅守正道，最終必能獲得吉祥。 \n\
 \n\
",
"[hexa] 剝 \n\
 \n\
剝卦 山地剝 艮上坤下 \n\
 \n\
剝：不利有攸往。 \n\
 \n\
《彖》曰：剝，剝也。柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息 盈虛，天行也。 \n\
 \n\
《象》曰：山附地上，剝。上以厚下安宅。 \n\
 \n\
初六：剝床以足，蔑貞，凶。      《象》曰：剝床以足， 以滅下也。 \n\
六二：剝床以辨，蔑貞，凶。      《象》曰：剝床以辨，未有與也。 \n\
六三：剝之，無咎。      《象》曰：剝之無咎，失上下也。 \n\
六四：剝床以膚，凶。    《象》曰：剝床以膚，切近災也。 \n\
六五：貫魚。以宮人寵，無不利。  《象》曰：以宮人寵，終無尤也。 \n\
上九：碩果不食，君子得輿，小人剝廬。    《象》曰：君子得輿，民所載也。小人剝廬，終不可用也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
《剝卦》是由艮上坤下的卦象所組成。 \n\
 \n\
《剝卦》解曰：剝，剝也。柔變剛也。不利有攸往，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。表示卦象中柔弱的陰爻被剛強的陽爻剝去，造成不利的情況，這與小人的行為有關。君子應當尊重事物的變化，保持平衡。 \n\
 \n\
《象》說：山附地上，剝。上以厚下安宅。表示山附著於地，地被剝去，上以厚實的方式保護下方，這樣可以確保安全居所。 \n\
 \n\
初六：剝床以足，蔑貞，凶。解曰：初六剝床以足，表示用腳剝去床，意味著剝奪基礎，這樣的行為是不正確的，將會帶來凶險。 \n\
 \n\
六二：剝床以辨，蔑貞，凶。解曰：六二剝床以辨，表示用刀剝去床的邊緣，這樣的行為也是不正確的，將會帶來凶險。 \n\
 \n\
六三：剝之，無咎。解曰：六三剝去，但不會有咎。表示放下某些不必要的東西，雖然有損失，但不會有大的傷害。 \n\
 \n\
六四：剝床以膚，凶。解曰：六四剝床以膚，表示把床剝到只剩下膚皮，這樣的行為會帶來凶險。 \n\
 \n\
六五：貫魚。以宮人寵，無不利。解曰：六五像是穿魚，表示能夠巧妙地應對困難，並受到宮人的寵愛，這樣將不會有不利。 \n\
 \n\
上九：碩果不食，君子得輿，小人剝廬。解曰：上九表示大果實不能被食用，君子獲得車輿，而小人則剝奪了住處。這是因為君子能夠得到更高的地位，而小人則失去了基礎。 \n\
 \n\
",
"[hexa] 泰 \n\
 \n\
泰卦 地天泰 坤上乾下 \n\
 \n\
泰：小往大來，吉亨。 \n\
 \n\
《彖》曰：泰，小往大來，吉亨。則是天地交而萬物通也，上下交而其志同也。內陽而外陰，內健而外順，內君子而外小人。君子道長，小人道消也。 \n\
 \n\
《象》曰：天地交，泰。後以財成天地之道，輔相天地之宜，以左右民。 \n\
 \n\
初九：拔茅茹，以其匯，徵吉。    《象》曰：拔茅徵吉，志在外也。 \n\
九二：包荒，用馮河，不遐遺。朋亡，得尚於中行。  《象》曰：包荒，得尚於中行，以光大也。 \n\
九三：無平不陂，無往不復，艱貞無咎。勿恤其孚，於食有福。        《象》曰：無往不復，天地際也。 \n\
六四：翩翩，不富以其鄰，不戒以孚。      《象》曰：翩翩不富，皆失實也。不戒以孚，中心願也。 \n\
六五：帝乙歸妹，以祉元吉。      《象》曰：以祉元吉，中以行願也。 \n\
上六：城復於隍，勿用師。自邑告命，貞吝。        《象》曰：城復於隍，其命亂也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
泰卦 地天泰 坤上乾下 \n\
 \n\
泰卦的解釋：小的往大的方向發展，吉祥亨通。《彖曰》說，泰卦表示小的變化趨向於大的發展，吉祥亨通。這象徵著天地交融，萬物通達；上下相交，志向相同。內部陽氣與外部陰氣相輔相成，內部強大而外部順從，內部有君子而外部有小人。君子的道路是延續不斷的，而小人的道路是逐漸消失的。 \n\
 \n\
《象曰》說，天地交融，就是泰卦的卦象。後來形成了財富，成就了天地之道，輔助了天地之間的宜和，引導著人們左右互相協助。 \n\
 \n\
初九爻辭：拔除雜草，把它聚在一起，徵得吉祥。《象曰》解釋，拔除雜草徵得吉祥，表明志向在外部。 \n\
 \n\
九二爻辭：整理荒地，利用馮河，沒有一處被遺忘。失去朋友，但在中行為中獲得了提升。《象曰》解釋，整理荒地，獲得提升，是因為光大而不被遺忘。 \n\
 \n\
九三爻辭：沒有平地不有坡，沒有往路不返回，雖然困難但堅守正道就不會有災禍。不要擔心他的信實，這樣在進食時就會有福報。《象曰》解釋，沒有往路不返回，表示天地之際。 \n\
 \n\
六四爻辭：輕盈地飄動，不以其鄰人富有，也不懼怕別人的信任。《象曰》解釋，輕盈地飄動，不富有，是因為都失去了實質。不懼怕別人的信任，是內心的願望。 \n\
 \n\
六五爻辭：帝乙將妹妹嫁出，以祈求幸福。《象曰》解釋，以祈求幸福，是中心的行動。 \n\
 \n\
上六爻辭：城市恢復到荒廢的狀態，不要動用軍隊。從城邑中傳來告命，堅守正道會有困難。《象曰》解釋，城市恢復到荒廢的狀態，表示命運混亂。 \n\
 \n\
",
"[hexa] 臨 \n\
 \n\
臨卦 地澤臨 坤上兌下 \n\
 \n\
臨：元，亨，利，貞。至於八月有凶。 \n\
 \n\
《彖》曰：臨，剛浸而長。說而順，剛中而應。大亨以正，天之道也。至於八月有凶，消不 久也。 \n\
 \n\
《象》曰：澤上有地，臨。君子以教思無窮，容保民無疆。 \n\
 \n\
初九：咸臨，貞吉。      《象》曰：咸臨 貞吉，志行正也。 \n\
九二：咸臨，吉，無不利。        《象》曰：咸臨，吉，無不利，未順命也。 \n\
六三：甘臨，無攸利。既憂之，無咎。      《象》曰：甘臨，位不當也。既憂之，咎不長也。 \n\
六四：至臨，無咎。      《象》曰：至臨無咎，位當也。 \n\
六五：知臨，大君之宜，吉。      《象》曰：大君之宜，行中之謂也。 \n\
上六：敦臨，吉，無咎。  《象》曰：敦臨之吉，志在內也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
臨卦 地澤臨 坤上兌下 \n\
 \n\
臨卦的解釋：初爻表示臨卦的本質，是一個具有元、亨、利、貞的卦象。然而，在八月會有凶兆，這是因為過於消耗而引起的不祥之兆。 \n\
 \n\
《彖曰》說，臨卦中陽爻逐漸滲透而增長，柔順而順應，剛偏中正應，大亨通達是符合天的道理。至於八月有凶兆，是因為過度的耗損導致不祥，但這並不會持續太久。 \n\
 \n\
《象曰》解釋，澤在上面，地在下面，是臨卦的卦象。君子應當思考無窮，容納保護民眾無窮。 \n\
 \n\
初九爻辭：全體臨卦，貞吉。《象曰》解釋，全體臨卦，貞吉，表明志向正確。 \n\
 \n\
九二爻辭：全體臨卦，吉祥，沒有不利。《象曰》解釋，全體臨卦，吉祥，沒有不利，是因為尚未順應命令。 \n\
 \n\
六三爻辭：和樂臨卦，沒有什麼好處。雖然憂慮，但沒有災禍。《象曰》解釋，和樂臨卦，是因為位置不當。雖然憂慮，但災禍不會長久。 \n\
 \n\
六四爻辭：合宜臨卦，沒有災禍。《象曰》解釋，合宜臨卦，沒有災禍，表示位置得當。 \n\
 \n\
六五爻辭：明智臨卦，對於大君是合宜的，吉祥。《象曰》解釋，明智臨卦，對於大君是合宜的，是行中之謂。 \n\
 \n\
上六爻辭：誠實臨卦，吉祥，沒有災禍。《象曰》解釋，誠實臨卦的吉祥，表示志向在內心。 \n\
 \n\
",
"[hexa] 明夷 \n\
 \n\
明夷卦 地火明夷 坤上離下 \n\
 \n\
明夷：利艱貞。 \n\
 \n\
《彖》曰：明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。利艱貞，晦其明也。 內難而能正其志，箕子以之。 \n\
 \n\
《象》曰：明入地中，明夷。君子以蒞眾用晦而明。 \n\
 \n\
初九：明夷于飛，垂其翼。君子於行，三日不食。有攸往，主人有言。  《象》曰：君子於行，義不食也。 \n\
六二：明夷，夷於左股，用拯馬壯，吉。    《象》曰：六二之吉，順以則也。 \n\
九三：明夷於南狩，得其大首，不可疾，貞。        《象》曰：南狩之志，乃大得也。 \n\
六四：入於左腹，獲明夷之心，於出門庭。  《象》曰：入於左腹，獲心意也。 \n\
六五：箕子之明夷，利貞。        《象》曰：箕子之貞，明不可息也。 \n\
上六：不明，晦。初登於天，後入於地。    《象》曰：初登於天，照四國也。後入於地，失則也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
明夷卦 地火明夷 坤上離下 \n\
 \n\
明夷卦的解釋：明夷卦，表示光明被埋沒在地下。內在的文明而外在柔順，以遮蔽大難，文王曾經利用這個卦。利於艱難之中保持堅定。箕子也曾以明夷卦來表達他的志向。 \n\
 \n\
《象曰》解釋，光明被埋沒在地下，君子應當在眾人中應用晦澀而又保持明亮。 \n\
 \n\
初九爻辭：光明被埋沒在高空中，翅膀垂下。君子在行動中，三天不進食。有人前來告訴主人有事。《象曰》解釋，君子在行動中，因為要堅持正義，所以不食言辭。 \n\
 \n\
六二爻辭：光明被埋沒，夷於左股，使用拯救馬匹的方法，是吉祥的。《象曰》解釋，六二爻的吉祥是因為順應了情勢。 \n\
 \n\
九三爻辭：光明被埋沒在南方的狩獵中，捕捉到巨大的首級，不可輕率，保持正固。《象曰》解釋，南方狩獵的志向，是非常大的獲得。 \n\
 \n\
六四爻辭：光明進入左腹，獲得明夷之心，然後走出門庭。《象曰》解釋，進入左腹，獲得心意，表明成功獲得支持。 \n\
 \n\
六五爻辭：箕子在明夷的時刻，利於保持正固。《象曰》解釋，箕子的正固，表示明亮不可消失。 \n\
 \n\
上六爻辭：不明，處於黑暗中。初次升入天空，後來陷入地下。《象曰》解釋，初次升入天空，照亮四國。後來陷入地下，是失敗的象徵。 \n\
 \n\
",
"[hexa] 復 \n\
 \n\
復卦 地雷復 坤上震下 \n\
 \n\
復：亨。出入無疾，朋來無咎。反復其道，七日來復，利有攸往。 \n\
 \n\
《彖》曰：復。亨。剛反，動而以順行，是以出入無疾，朋來無咎。反復其道，七日來復，天行也。利有攸往，剛長也。復其見天地之心乎？ \n\
 \n\
《象》曰：雷在地中，復。先王以至日閉關，商旅不行，後不省方。 \n\
 \n\
初九：不遠復，無祗悔，元吉。    《象》曰：不遠之復，以修身也。 \n\
六二：休復，吉。        《象》曰：休復之吉，以下仁也。 \n\
六三：頻復，厲，無咎。  《象》曰：頻復之厲，義無咎也。 \n\
六四：中行獨復。        《象》曰：中行獨復，以從道也。 \n\
六五：敦復，無悔。      《象》曰：敦復無悔，中以自考也。 \n\
上六：迷復，凶，有災眚。用行師，終有大敗，以其國君凶，至於十年，不克徵。        《象》曰：迷復之凶，反君道也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
復卦 地雷復 坤上震下 \n\
 \n\
復卦的解釋：復卦，表示亨通。出入順利，朋友來臨也沒有災禍。持續回歸正道，七天之後會有好轉，有利於前進。 \n\
 \n\
《彖曰》說，復卦是亨通的象徵。剛強的力量回歸，動而順應，所以出入沒有阻礙，朋友來臨也沒有災禍。持續回歸正道，七天之後會有好轉，這是天道運行的表現。利於前進，是因為剛強的力量長久存在。能否回歸到見天地之心呢？ \n\
 \n\
《象曰》解釋，雷在地中，是復卦的卦象。先王為了至善而閉關，商旅不外出，後來也不再檢查方向。 \n\
 \n\
初九爻辭：不遠的回歸，不會有懊悔，是極為吉祥的。《象曰》解釋，不遠的回歸，是為了修身。 \n\
 \n\
六二爻辭：休息之後再回歸，是吉祥的。《象曰》解釋，休息之後再回歸，是因為處於仁慈的境地。 \n\
 \n\
六三爻辭：頻繁地回歸，有危險，但不會有災禍。《象曰》解釋，頻繁地回歸，有危險，但是堅持正義就不會有災禍。 \n\
 \n\
六四爻辭：中行獨自回歸。《象曰》解釋，中行獨自回歸，是因為要遵從正道。 \n\
 \n\
六五爻辭：堅持回歸，不會有懊悔。《象曰》解釋，堅持回歸，不會有懊悔，是因為內心持守。 \n\
 \n\
上六爻辭：迷失而回歸，凶兆，有災難。派遣軍隊行動，最終會有巨大的失敗，因為國君遭遇凶兆，十年間無法成功徵兵。《象曰》解釋，迷失而回歸，是因為背離君主的道路。 \n\
 \n\
",
"[hexa] 升 \n\
 \n\
升卦 地風升 坤上巽下 \n\
 \n\
升：元亨，用見大人，勿恤，南徵吉。 \n\
 \n\
《彖》曰：柔以時升，巽而順，剛中而應，是以大亨。用見大人，勿恤，有慶也。南徵吉， 志行也。 \n\
 \n\
《象》曰：地中生木，升。君子以順德，積小以高大。 \n\
 \n\
初六：允升，大吉。      《象》曰：允升大吉，上合志也。 \n\
九二：孚乃利用禴，無咎。        《象》曰：九二之孚，有喜也。 \n\
九三：升虛邑。  《象》曰：升虛邑，無所疑也。 \n\
六四：王用亨於岐山，吉，無咎。  《象》曰：王用亨於岐山，順事也。 \n\
六五：貞吉，升階。      《象》曰：貞吉升階，大得志也。 \n\
上六：冥升，利於不息之貞。      《象》曰：冥升在上，消不富也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
升卦 地風升 坤上巽下 \n\
 \n\
升卦的解釋：升卦，表示大吉大利，有利於見到位高的人，不必擔憂，南方出行會帶來吉祥。 \n\
 \n\
《彖曰》說，升卦用柔順的方式適時地上升，巽而順應，剛強而能應對，因此可以獲得大亨通。在見到位高的人時，不必擔心，這是一個值得慶賀的時刻。南方出行吉祥，是因為有志向而行動。 \n\
 \n\
《象曰》解釋，地中生出樹木，樹木向上生長，這就是升卦的卦象。君子應當順應德行，累積微小的努力來達到高大的目標。 \n\
 \n\
初六爻辭：能夠升上去，大吉大利。《象曰》解釋，能夠升上去，是因為上升與志向相合。 \n\
 \n\
九二爻辭：真誠誠信，可以利用禴祭，沒有災禍。《象曰》解釋：九二爻的真誠誠信，帶來了喜悅。 \n\
 \n\
九三爻辭：上升到虛空的都市。《象曰》解釋：上升到虛空的都市，表示沒有疑慮。 \n\
 \n\
六四爻辭：君王在岐山進行祭祀，吉祥，沒有災禍。《象曰》解釋：君王在岐山進行祭祀，是順應事勢的表現。 \n\
 \n\
六五爻辭：堅守正道吉祥，上升到更高的階層。《象曰》解釋：堅守正道吉祥，上升到更高的階層，表明大大實現了志向。 \n\
 \n\
上六爻辭：陷入迷惑，上升卻在黑暗中，利於不斷持守正道的堅定。《象曰》解釋：陷入迷惑，上升卻在黑暗中，是因為消耗太多而不能富有。 \n\
 \n\
",
"[hexa] 師 \n\
 \n\
師卦 地水師 坤上坎下 \n\
 \n\
師：貞，丈人吉，無咎。 \n\
 \n\
《彖》曰：師，眾也，貞正也，能以眾正，可以王矣。剛中而應，行險而順，以此毒天下， 而民從之，吉又何咎矣？ \n\
 \n\
《象》曰：地中有水，師，君子以容民蓄眾。 \n\
 \n\
初六：師出以律，否臧凶。        《象》曰：師出以律， 失律凶也。 \n\
九二：在師，中吉，無咎，王三錫命。      《象》曰：在師中吉，承天寵也。王三錫命，懷萬邦也。 \n\
六三：師或輿屍，凶。    《象》曰：師或輿屍，大無功也。 \n\
六四：師左次，無咎。    《象》曰：左次無咎，未失常也。 \n\
六五：田有禽，利執；言，無咎。長子帥師，弟子輿屍，貞凶。        《象》曰：長子帥師，以中行也。弟子輿師，使不當也。 \n\
上六：大君有命，開國承家，小人勿用。    《象》曰：大君有命，以正功也。小人勿用，必亂邦也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
師卦 地水師 坤上坎下 \n\
 \n\
師卦的解釋：師卦，表示要持守正道，則眾人皆吉祥，沒有災禍。 \n\
 \n\
《彖曰》說，師卦象徵著眾多的人，表示要持守正道，能夠以眾人的力量來保持正確，這樣就能夠成為王者。剛強而能夠應對，勇往直前卻能保持順從，這樣的特點使得師卦能夠對抗天下的困難，人民也會跟隨。吉祥之後還有什麼災禍呢？ \n\
 \n\
《象曰》解釋，地中有水，是師卦的卦象。君子應當包容眾人，儲備眾多的力量。 \n\
 \n\
初六爻辭：師出征以律法，否臧凶。《象曰》解釋：師出征以律法，失去法紀會帶來凶兆。 \n\
 \n\
九二爻辭：在師中，吉祥，沒有災禍，君王賜命。《象曰》解釋：在師中吉祥，表示受到天命的寵愛。君王賜命，是懷有對萬邦的愛懷。 \n\
 \n\
六三爻辭：師隨行車運載屍體，凶兆。《象曰》解釋：師隨行車運載屍體，表示沒有功績而有大凶兆。 \n\
 \n\
六四爻辭：師左次，沒有災禍。《象曰》解釋：左次沒有災禍，表示沒有失去正常的秩序。 \n\
 \n\
六五爻辭：田地裡有禽鳥，有利於捕捉；言語誠實，沒有災禍。長子帶領軍隊，弟子卻要運載屍體，這樣的卦象凶兆。《象曰》解釋：長子帶領軍隊，是因為能夠中正行事。弟子卻運載屍體，表示使命不當。 \n\
 \n\
上六爻辭：大君有命，開國承家，小人不應用。《象曰》解釋：大君有命，表示能夠進行正當的事業。小人不應該被使用，否則會使國家陷入混亂。 \n\
 \n\
",
"[hexa] 謙 \n\
 \n\
謙卦 地山謙 坤上艮下 \n\
 \n\
謙：亨，君子有終。 \n\
 \n\
《彖》曰：謙，亨。天道下濟而光明，地道卑而上行。天道虧盈而益謙，地道變盈而流謙， 鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。 \n\
 \n\
《象》曰：地中有山，謙。君子以裒多益寡，稱物平施。 \n\
 \n\
初六：謙謙君子，用涉大川，吉。  《象》曰：謙謙君子，卑以自牧也。 \n\
六二：鳴謙，貞吉。      《象》曰：鳴謙貞吉，中心得也。 \n\
九三：勞謙君子，有終，吉。      《象》曰：勞謙君子，萬民服也。 \n\
六四：無不利，撝謙。    《象》曰：無不利，撝謙，不違則也。 \n\
六五：不富以其鄰，利用侵伐，無不利。    《象》曰：利用侵伐，徵不服也。 \n\
上六：鳴謙，利用行師，徵邑國。  《象》曰：鳴謙，志未得也。可用行師，徵邑國也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
謙卦 地山謙 坤上艮下 \n\
 \n\
謙卦的解釋：謙卦，表示通達，君子謙虛能有終結。 \n\
 \n\
《彖曰》說，謙卦通達。天道下濟而光明，地道卑微而向上行。天道總是虧少而增加謙虛，地道變動總是充盈而流露謙虛，神明受益於謙虛而有福報，人道行為儉約而喜好謙虛。謙虛尊貴而光明，卑微而不可超越，這是君子的終結。 \n\
 \n\
《象曰》解釋，地中有山，這就是謙卦的卦象。君子應當像山一樣堅實穩重，多給予他人而少索取。 \n\
 \n\
初六爻辭：謙虛的君子，能夠涉越大河，吉祥。《象曰》解釋：謙虛的君子，因為謙卑而能夠自我約束。 \n\
 \n\
六二爻辭：謙虛而有節制，貞吉。《象曰》解釋：謙虛而有節制，貞吉，是因為內心得到了保持。 \n\
 \n\
九三爻辭：辛勤謙虛的君子，能夠有終結，吉祥。《象曰》解釋：辛勤謙虛的君子，是因為得到眾人的服從。 \n\
 \n\
六四爻辭：無不利，只要謙虛。《象曰》解釋：無論何事，只要能夠謙虛，就不會有不利。 \n\
 \n\
六五爻辭：不取鄰人的富裕，可以利用侵略，無不利。《象曰》解釋：不取鄰人的富裕，利用侵略，表示他們不會有不利。 \n\
 \n\
上六爻辭：謙虛而有節制，可以利用行師，征服邑國。《象曰》解釋：謙虛而有節制，可以利用行師，征服邑國，是因為志向未得到滿足，可用行師，征服邑國。 \n\
 \n\
",
"[hexa] 坤 \n\
 \n\
坤卦 坤為地 坤上坤下 \n\
 \n\
坤：元亨，利牝馬之貞。君子有攸往，先迷後得主。利西南得朋，東北喪朋。安貞吉。 \n\
 \n\
《彖》曰：至哉坤元，萬物資生，乃順承天。坤厚載物，德合無疆。含弘光大，品物咸亨。牝馬地類，行地無疆，柔順利貞。君子攸行，先迷失道，後順得常。西南得朋，乃與類行；東北喪朋，乃終有慶。安貞之吉，應地無疆。 \n\
 \n\
《象》曰：地勢坤，君子以厚德載物。 \n\
 \n\
初六：履霜，堅冰至。    《象》曰：履霜堅冰，陰始凝也。馴致其道，至堅冰也。 \n\
六二：直方大，不習，無不利。    《象》曰：六二之動，直以方也。不習，無不利，地道光也。 \n\
六三：含章可貞。或從王事，無成有終。    《象》曰：含章可貞；以時發也。或從王事，知光大也。 \n\
六四：括囊，無咎無譽。  《象》曰：括囊無咎，慎不害也。 \n\
六五：黃裳，元吉。      《象》曰：黃裳元吉，文在中也。 \n\
上六：龍戰於野，其血玄黃。      《象》曰：龍戰於野，其道窮也。 \n\
 \n\
----------- \n\
白話解 \n\
----------- \n\
 \n\
坤卦 坤為地 坤上坤下 \n\
 \n\
坤卦：大吉大利，利於養育母馬。君子有所前往，初時或許會迷失方向，但後來會找到正路。有利於西南方向結交朋友，不利於東北方向失去朋友。安守正道是吉祥的。 \n\
 \n\
《彖曰》說，至於坤卦的根本，表徵萬物生生不息，遵從天道。坤的性質是厚重載物，德行合乎無窮無盡。坤的光大、寬容，適應萬物，如同母馬孕育生靈。地類似牝馬，態度柔順而穩定，有利於堅守正道。君子在行事途中，初時可能會迷失方向，但後來會找到正確的道路。向西南方向結交朋友會有利，而向東北方向失去朋友。安守正道是吉祥的。 \n\
 \n\
《象曰》解釋，坤卦的象徵是大地，君子應當具有厚德載物的精神。 \n\
 \n\
初六爻辭：行走在霜地上，堅冰即將來臨。《象曰》解釋：行走在霜地上，是因為陰氣開始凝結。要馴服陰氣，使其順應正道，就如同堅硬的冰即將到來。 \n\
 \n\
六二爻辭：直立而方正，不妄動，無不利。《象曰》解釋：六二爻的動作是直立而方正，是因為堅守正直。不妄動，無不利，是因為地道光明。 \n\
 \n\
六三爻辭：懷有美德，可以堅守正道。或許有從事王事的可能，但無法成就，最終會有喜慶。《象曰》解釋：懷有美德，可以堅守正道，就像地道在合宜的時候發生變動。或許有從事王事的可能，但無法成就，最終會有喜慶。 \n\
 \n\
六四爻辭：括囊而無咎，也沒有受到譽美。《象曰》解釋：括囊而無咎，是因為謹慎而不害人。 \n\
 \n\
六五爻辭：穿著黃裳，大吉大利。《象曰》解釋：穿著黃裳，大吉大利，是因為文明展現於其中。 \n\
 \n\
上六爻辭：龍在野外戰鬥，流出的血是玄色和黃色的。《象曰》解釋：龍在野外戰鬥，其道路已經走到盡頭。 \n\
"
]
